{
  "keywords": "rare earth",
  "title": "Victoria strengthens critical minerals capabilities with green light at Goschen - Australian Mining",
  "url": "https://www.australianmining.com.au/victoria-critical-minerals-green-light-goschen/",
  "content": "Victoria is continuing to deliver accelerated critical minerals capabilities thanks to an approved mining work plan for VHM’s Goschen rare earths and minerals sands project in the state’s northwest.\n\nThe work plan covers pre-production logistical considerations such as how to protect the local environment and community, including requirements such as monitoring air quality data and publishing real-time dust level data online.\n\nLocated in Victoria’s premier mineral sands corridor, the project is underpinned by a [199 million tonne proved and probable ore reserve]( and is understood to be scalable with a 629 million tonne mineral resource with “ongoing growth potential”.\n\nVictoria has been described as [possessing world-class mineral sand deposits]( containing demonstrated resources of titanium, zirconium and rare earth elements. As such, developing these is crucial to energy transition as it helps provide the materials needed for solar panels, wind turbines and batteries.\n\nThe project is understood to boast over 400,000 tonnes of total rare earth oxide alongside a “world-class” mineral sands resource, making it one of Australia’s most significant [critical minerals projects](\n\nNews of work plan approval comes after Victoria’s critical minerals future was advanced with the [approval of an exploration tunnel at the Sunday Creek]( antimony and gold projects, highlighting a shift in focus from both mining companies and industry bodies.\n\nDescribed as one of Victoria’s “most significant mineral sands and rare earths projects”, Victorian Energy Minister Lily D’Ambrosio noted the move goes beyond simply critical mineral capabilities across Victoria.\n\n“Critical minerals development in the Wimmera and Mallee could support up to 7,000 new jobs in the coming decades, and we are backing local communities with these well-paying jobs,” she said.\n\nThe [approval]( forms part of the Labor government’s Critical Minerals Roadmap set out last year to unlock the state’s critical minerals potential.",
  "weight": "0.9",
  "pickup_count": 4
}