{
  "keywords": "tesla",
  "title": "UK Autumn Budget: EV mileage tax prompts fleet cost concerns - Motor Finance Online",
  "url": "https://www.motorfinanceonline.com/news/uk-autumn-budget-ev-mileage-tax-prompts-fleet-cost-concerns/",
  "content": "Industry figures call for urgent consultation on road pricing system and support for operators facing rising costs during the transition to zero-emission transport\n\nFleet operators reacted cautiously to the Autumn Budget, which confirmed substantial reforms to motoring taxation alongside measures intended to stabilise public revenues. The new electric vehicle mileage charge, due from April 2028, was a focal point for organisations managing large car and van fleets.\n\nThe policy will see battery-electric vehicles taxed at 3p per mile and plug-in hybrids at 1.5p per mile.\n\nThe gold standard of business intelligence.\n\nExperience unmatched clarity with a single platform that combines unique data, AI, and human expertise.\n\nPaul Hollick, Chair of the Association of Fleet Professionals ([AFP]( said fleets must now shape how the scheme is implemented. He warned that the charge “shouldn’t arrive in a form that could hamper electrification or cause any hesitation among potential business and private EV buyers,” adding that the AFP will play a central role in sector consultation.\n\nFrom a remarketing standpoint, Philip Nothard, Chair of the [Vehicle Remarketing Association]( said the arrival of road pricing is “no surprise,” but emphasised the need to ensure it does not damage consumer perception of EVs. Nothard said simplicity and clarity will be critical to maintaining demand for both new and used electric models.\n\nA number of operators expressed stronger concerns. Paul Holland, Managing Director for UK/ANZ Fleet at [Corpay]( said the new charge is “completely the wrong move at the wrong moment,” adding that businesses are being asked to “absorb even more pressure” while support for commercial EV adoption remains limited.\n\nDavid Bushnell, Director of Consultancy and Strategy at [Fleet Operations]( described the Budget as offering “little meaningful support for the electrification of transport,” warning that higher lifetime EV costs could reduce sales by hundreds of thousands and “destabilise used values.”\n\n# US Tariffs are shifting - will you react or anticipate?\n\nDon’t let policy changes catch you off guard. Stay proactive with real-time data and expert analysis.\n\nAlongside eVED, the reversal of the fuel duty freeze triggered further disquiet. Fuel duty will rise in stages from late 2026 before moving to RPI indexation.\n\nSimon Williams, Head of Policy at the RAC, said drivers will welcome the temporary continuance of the 5p cut, but that the relief will be “very short-lived” given the scheduled increases.\n\nThere were, however, positive reactions to several announcements.\n\nJohn Peters, Head of Consultancy at [Arval UK,]( said the £1.3 billion extension of the Electric Car Grant will “support business-need vehicles and salary sacrifice schemes,” helping offset any decline in EV demand caused by road pricing. Peters also welcomed the uplift in the Expensive Car Supplement threshold, saying it makes “many popular electric cars more accessible for fleets.”\n\nSuzanne (Sue) Robinson, Chief Executive of the [National Franchised Dealers Association]( similarly endorsed the ECS rise and said the grant extension could generate “an extra 130,000 electric car sales,” though she warned that pay-per-mile taxation “risks undermining consumer confidence at a critical moment.”\n\nDelays to Employee Car Ownership Scheme (ECOS) reforms until 2030 were also widely welcomed. James Tew, CEO at [iVendi]( said the postponement avoids immediate disruption to dealer recruitment and nearly-new stock supply.\n\n### Sign up for our daily news round-up!\n\n### Give your business an edge with our leading industry insights.\n\nThe gold standard of business intelligence.\n\nExperience unmatched clarity with a single platform that combines unique data, AI, and human expertise.\n\n#### Sign up for our daily news round-up!\n\nGive your business an edge with our leading industry insights.\n\nGive your business an edge with our leading industry insights.\n\n[View all newsletters]( from across the GlobalData Media network.",
  "weight": "0.7",
  "pickup_count": 0
}