{
  "keywords": "tesla",
  "title": "Petersen Museum's Newest Exhibit Showcases Iconic Off-Road Racers - Car and Driver",
  "url": "https://www.caranddriver.com/news/a69560711/petersen-museum-legends-of-the-dirt-exhibit/",
  "content": "**New!**Shop For Cars Available Near You.\n\nGot it!\n\nCalled 'Legends of the Dirt,' it includes a classic Bronco Baja winner and possibly the craziest Suzuki hatchback of all time.\n\n*   **There's a classic Bronco Baja winner, an Italian WRC legend, and possibly the craziest Suzuki hatchback of all time.**\n\nWhile the Petersen Automotive Museum is otherwise a glittering collection of gleaming sheetmetal on polished floors, its latest exhibition is all about getting mud on your boots. Dubbed \"Legends of the Dirt, the exhibit features some of the greatest off-road racing machines from the Baja 1000, King of the Hammers, and the World Rally Championship.\n\nFrom the latter, we have the 1983 Lancia Rally 037, the last rear-wheel-drive car to hold its own against the onslaught of all-wheel-drive machines in WRC racing. Driven by Finn Markku Alén and Walter Röhrl (perhaps better known for his exploits racing for Audi), this car won Lancia the Constructor's title in 1983. Every winning driver since then has been in an AWD machine.\n\nSpeaking of all-wheel drive, few machines are nuttier than the 1993 Suzuki Cultus Pikes Peak Special. You may remember this subcompact hatchback as the Suzuki Swift or Pontiac Firefly (or even the Geo Metro, as it was sold here), which ordinarily had front-wheel drive and no more than 100 hp. This example has almost eight times as much.\n\nRaced at the Pikes Peak International Hillclimb by the affable Nouhiro \"Monster\" Tajima—and by thousands of youngsters in _Gran Turismo 2_—this hugely winged hatchback makes its power through a turbocharged 1.6-liter four-cylinder engine mounted up front. And, also, a second turbocharged 1.6-liter four-cylinder engine in the rear. That's a lot of motor for one little car, especially one that tips the scales at less than 2000 pounds.\n\nThe Petersen will also be featuring a number of significant off-road racing trucks, including the 1995 Herbst \"Landshark.\" A SCORE International Class 1 desert racer, this custom-built off-roader was a game changer when it arrived on the sands in the mid-1990s, a cross between a traditional buggy-style Baja racer and the toughness of a truck.\n\nOther Baja legends include the 1970 Bronco \"Big Oly\" as driven by Parnelli Jones to two consecutive Baja 1000 wins (1971 and 1972). It looks like a Bronco on the outside, but it's a custom tube chassis underneath with a partially composite body. Like any good dune racer, it loves to fly.\n\nOther notable examples on display include the first King of the Hammers-winning Ford Bronco Ultra4, a 2010 Coleworks rock bouncer made for extreme vertical climbing, and a Global Rallycross Volkswagen Beetle GRC. Alongside these will be a collection of historically significant off-road racing motorcycles, along with displays explaining how off-road tech works.\n\nThis is the first time the Petersen has really gone big into an off-roading display, so if you're a fan of low-flying Fords taking to the skies above the Baja peninsula, you're going to want to schedule a visit. The exhibit opens on December 7 and runs right through January 2027. And they won't even make you wipe your feet before they let you in.\n\n*   [![Image 16: Lancia Stratos front three quarter]( Petersen Exhibit Spotlights Wedge-Shaped Cars](\n\nBrendan McAleer is a freelance writer and photographer based in North Vancouver, B.C., Canada. He grew up splitting his knuckles on British automobiles, came of age in the golden era of Japanese sport-compact performance, and began writing about cars and people in 2008. His particular interest is the intersection between humanity and machinery, whether it is the racing career of Walter Cronkite or Japanese animator Hayao Miyazaki's half-century obsession with the Citroën 2CV. He has taught both of his young daughters how to shift a manual transmission and is grateful for the excuse they provide to be perpetually buying Hot Wheels.\n\n[![Image 21: fastport equad]( We Sampled Honda's Fastport eQuad Delivery Vehicle]( 22: sp40 restomod speedster]( See Edsel Ford's 1934 Speedster as a Rad Restomod]( 23: front three quarter view of silver roadster parked on blacktop near open field with trees and blue sky.]( 1999 Dodge Viper Is Today's Bring a Trailer Find]( 24: 2026 rivian r1t quad motor driving test hub lead]( Rivian's Quad-Motor R1T Can Outrun Corvettes](\n\n[![Image 25: land rover defender dakar d7x r exterior.]( Land Rover Defender Dakar D7X-R Is Ready to Race]( 26: front three quarter view of tan and beige suv with lifted suspension on white studio background.]( 1978 International Harvester Scout II BaT Auction]( 27: hybrid maverick awd test hub]( Ford's Facelifted Maverick Hybrid Is a Lot Quicker]( 28: 2026 mercedes benz cla ev]( New Mercedes CLA EV Can Be Yours for Under $49K](\n\n[![Image 29: porsche cayenne electric]( Porsche Says Cayenne EV Sees Record Early Demand]( 30: fbi seized mercedesbenz clk gtr roadster]( FBI Seizes $13M Mercedes-Benz CLK GTR Roadster]( 31: thor5f female crash test dummy]( New Crash Test Dummy to Make Cars Safer for Women]( 32: 2026 bmw z4 final edition]( 2026 BMW Z4 Courts Collectors with Final Edition](\n\n[About Us]( Cars]( Car Rankings]( Us]( Reviews]( SUVs]( We Test Cars]( and Features]( 3-Row SUVs]( Feed]( We Rate Cars]( Gear]( Hybrid SUVs]( Autos]( Cars]( EVs]( Service]( My Car Worth?]( Used Cars for Sale]( New Cars for Sale]( 39: Hearst Autos - A Part of Hearst Digital Media](\n\nWe may earn a commission for purchases made through our links.\n\n[Privacy Notice]( Notice at Collection]( CA Privacy Rights/Shine the Light]( Industry Opt Out]( of Use]( Map](\n\n[![Image 40: Opt-Out Icon]( Privacy Choices: Opt Out of Sale/Targeted Ads]( \"Your Privacy Choices: Opt Out of Sale/Targeted Ads\")\n\nWe use technologies that provide information about your interactions with this site to others for functionality, analytics, targeted advertising, and other purposes. [Learn more in our Privacy Notice]( You agree that your use of this website and the Hearst Services is governed by the [Terms of Use]( (including [the dispute resolution procedures](",
  "weight": "0.7",
  "pickup_count": 0
}