{
  "keywords": "tesla",
  "title": "Here's What Tesla's New Range of Affordable Electric Cars Cost - CNET",
  "url": "https://www.cnet.com/home/electric-vehicles/heres-what-teslas-new-range-of-affordable-electric-cars-cost/",
  "content": "What you get with the stripped-down Model Y and Model 3.\n\nTesla has launched a range of more affordable [electric cars](/home/electric-vehicles/best-ev-electric-car/) -- stripped-back versions of the [refreshed Model Y](/home/electric-vehicles/teslas-model-y-redesign-has-arrived-but-maybe-not-where-you-are/) and [Model 3](/home/electric-vehicles/tesla-model-3-refreshed-with-new-look-longer-range/). These pared-down EVs lower the starting cost, making it easier for more people to own a Tesla.\n\nThis change is long overdue. As someone who's spent plenty of time behind the wheel of both cars, I see it as a move that could significantly boost Tesla ownership.\n\nThe idea is simple: Make the same design and driving experience accessible to more people by eliminating the extras that most owners rarely use. In my view, that's a smart move.\n\nIt comes at a time when electric vehicle shoppers will be seeking more affordable options. According to June figures from [Kelley Blue Book]( the average new vehicle transaction price in the US sits at $49,077, while EVs cost $57,245 on average. That's lower than the market peak in December 2023, but it's still about $10,500 higher than five years ago.\n\n## How much do Tesla's cheaper cars cost, and what do they come with?\n\nThe Model Y Standard Rear-Wheel Drive starts at $39,990 and delivers an EPA-estimated range of 321 miles, a 0-60 mph time of 6.8 seconds and a peak charging rate of 225 kW. It's powered by a 69 kWh battery and produces about 300 horsepower. This version uses one fewer battery module than the higher trims and is 5% more efficient than the Model Y RWD.\n\nInside, it features an open-concept center console similar to the Cybertruck, as well as textile doors and dashboard trim. The 10-way driver and four-way passenger seat controls are now managed via the touchscreen, eliminating the need for physical buttons.\n\nTesla includes a seven-speaker audio system, auto high beams and dual-tone textile and vegan leather seats, but most of the cabin adjustments are manual. That includes the seats, steering wheel and mirrors. The front seats are heated, while the rear ones are not.\n\n*Don't miss any of our unbiased tech content and lab-based reviews.* [*Add CNET*]( *as a preferred Google source.*\n\nThe rear passenger screen has been removed, but the car still includes a mobile charger. The glass roof is now closed internally with a fabric headliner for improved insulation, and the mirrors are manually folding. Also, there's no HEPA filter, only a particulate and odor filter.\n\nThe Model Y Standard comes standard with 18-inch wheels, with 19-inch wheels available as an optional upgrade, and offers 75 cubic feet of cargo space. Towing capacity is 3,500 pounds, and curb weight is 4,061 pounds. It supports Tesla's well-established Supercharging network and can add up to 160 miles in about 15 minutes. This version is available in three colors: stealth gray, pearl multicoat white and diamond black.\n\nMeanwhile, the Model 3 Standard Rear-Wheel Drive now starts at $36,990 and shares many of the same hardware and software characteristics. It has the same 69 kWh battery, delivers 321 miles of EPA range and accelerates from 0 to 60 mph in 5.8 seconds thanks to 286 horsepower.\n\nTesla has added a front bumper camera with a washer like the Model Y, uses vegan leather and textile seating and has touchscreen-controlled seat adjustments instead of physical switches. There are manual second-row folding seats, a manual-adjust steering wheel and mirrors and no rear heated seats or ventilation.\n\nIt retains the glass panoramic roof but has acoustic front door glass and tempered rear glass. The rear screen has been removed, and the center console now features uncovered cupholders. It also features a 7-speaker audio setup and the same 15.4-inch touchscreen that dominates the interior.\n\nCharging speeds are identical at up to 225 kW, and Tesla claims up to 170 miles of range can be added in 15 minutes. It weighs 3,759 pounds and has 24 cubic feet of cargo space. This trim offers the same three paint choices as the more expensive options.\n\nBoth cars ship with manual second-row air vents, ditch the LED strips in favor of footwell and door-pocket ambient lighting only, and come with standard LED headlights with auto adaptive high beams (no matrix LEDs). Interestingly, they also omit Autosteer, although they come with traffic-aware cruise control as standard.\n\n[Full Self-Driving]( is optional, available for $8,000 or via a $99 monthly subscription. Tesla is offering the same four trim levels for each model: Standard, Premium RWD, Premium AWD and Performance.\n\nI think this new approach makes a lot of sense for Tesla. Instead of chasing the luxury end of the market, this brings the focus back to what originally made the brand so popular: offering long-range, fast-charging, affordable electric vehicles that still feel cutting-edge. By trimming back on extras, the company has created an option that could appeal to first-time EV buyers who might otherwise look at cheaper rivals.\n\nIn my experience, Tesla's biggest strength has always been its software and driving dynamics, and those remain intact here. For anyone on the fence about making the switch to an EV, these new versions of the Model 3 and Model Y could be the most convincing reason yet.\n\nPricing for the Model Y Standard starts at $39,990, while the Model 3 Standard follows closely behind at $36,990. Global pricing has not yet been announced, but expect it to also undercut the existing Long Range model.\n\nFor now, this is the most accessible way to buy a Tesla.\n\nConnor is a technology writer and editor, with a byline on multiple platforms. He has been writing for around nine years now across the web and in print too. Connor has attended the biggest tech expos, including CES, MWC, and IFA -- with contributions as a judge on panels at them. He's also been interviewed as a technology expert on TV and radio by national news outlets including France24. Connor has experience with most major platforms, though does hold a place in his heart for macOS, iOS/iPadOS, electric vehicles, and smartphone tech. Just like everyone else around here, he's a fan of gadgets of all sorts. Aside from writing, Connor is involved in the startup and venture capital scene, which puts him at the front of new and exciting tech -- he is always on the lookout for innovative products.\n\n* [Tesla Solar Panels Review](/deals/tesla-solar-panels-review-cheaper-than-other-national-players/)\n\n* [Panasonic Evervolt Battery Review](/deals/panasonic-evervolt-home-battery-review-a-modular-and-powerful-approach/)\n\n* [Why Solar Panels Will Likely Keep Getting Cheaper](/deals/why-the-cost-of-solar-panels-will-likely-keep-falling/)\n\n* [How to Make Your Solar Panels Last Longer](/deals/how-to-make-sure-your-solar-panels-last-for-decades/)\n\n* [This Is How Many Solar Panels You'll Need to Power Your Home](/deals/this-is-how-many-solar-panels-you-need-to-power-your-house/)\n\n* [Solar Power Purchase Agreements Explained: The Pros and Cons](/deals/solar-power-purchase-agreements-explained-pros-cons/)\n\n* [Avoid Solar Panel Scams: 7 Tips for Getting a Great Deal](/deals/solar-panel-scams-7-red-flags-to-avoid/)\n\n* [Solar Panels Will Eventually Save You Money. How to Know When the real Savings Begin](/deals/this-formula-will-tell-you-when-solar-panels-can-pay-you-back/)\n\n* [This Is How Long You Can Expect Your Solar Panel Installation to Take](/deals/what-is-the-solar-panel-installation-timeline-from-purchase-to-power/)\n\n* [The Pros and Cons of Solar Panels](/deals/solar-panel-pros-and-cons-find-out-if-theyre-worth-it-for-you/)\n\n* [Ecobee Smart Thermostat Premium vs. Ecobee Smart Thermostat Enhanced](/deals/ecobee-smart-thermostat-premium-vs-ecobee-smart-thermostat-enhanced/)\n\n* [Anker Portable Power Station](/deals/this-anker-portable-power-station-back-down-best-price-187%2F/)\n\n* [Ecobee Smart Thermostat Enhanced vs. Nest Thermostat](/deals/ecobee-smart-thermostat-enhanced-vs-nest-thermostat-is-ecobee-or-nest-the-best/)\n\n* [Nest Learning Thermostat vs. Nest Thermostat](/deals/nest-learning-thermostat-vs-nest-thermostat/)\n\n* [Storage Tank Water Heaters vs. Tankless Water Heaters](/deals/storage-tank-water-heaters-vs-tankless-water-heaters/)\n\n* [Ecobee Smart Thermostat Premium vs. Ecobee Smart](/deals/ecobee-smart-thermostat-premium-vs-ecobee-smart-thermostat-enhanced/)\n\n* [Moving Off- Grid: My Ultimate Pandemic Project Is About More Than Utility Bills](/deals/moving-off-grid-the-ultimate-pandemic-project-is-about-more-than-utility-bills/)\n\n* [How Living With Solar Panels Demystified Electricity for Me](/deals/how-living-with-solar-panels-de-mystified-electricity-for-me/)\n\n* [For Life Off the Grid, Batteries Mean Independence](/deals/for-life-off-the-grid-batteries-mean-independence/)\n\n* [The Biggest Pros and Cons of Living Off-Grid Arent What I Expected](/deals/the-biggest-pros-and-cons-of-living-off-grid-arent-what-i-expected/)\n\n* [The Hidden (and Not So Hidden) Expenses of Living Off Grid](/deals/the-hidden-and-not-so-hidden-expenses-of-living-off-grid/)\n\n* [My Off-Grid Project: The Secrets I Learned to Save on Solar](/deals/my-off-grid-project-the-secrets-i-learned-to-maximize-savings/)\n\nCNET staff -- not advertisers, partners or business interests -- determine how we review the products and services we cover. If you buy through our links, we may get paid.\n\nConnor is a technology writer and editor, with a byline on multiple platforms. He has been writing for around nine years now across the web and in print too. Connor has attended the biggest tech expos, including CES, MWC, and IFA -- with contributions as a judge on panels at them. He's also been interviewed as a technology expert on TV and radio by national news outlets including France24. Connor has experience with most major platforms, though does hold a place in his heart for macOS, iOS/iPadOS, electric vehicles, and smartphone tech. Just like everyone else around here, he's a fan of gadgets of all sorts. Aside from writing, Connor is involved in the startup and venture capital scene, which puts him at the front of new and exciting tech -- he is always on the lookout for innovative products.\n\nWe thoroughly evaluate each company and product we review and ensure our stories meet our high editorial standards.",
  "weight": "0.7",
  "pickup_count": 4
}