{
  "keywords": "rare earth",
  "title": "Foreign media on Kazakhstan: Kazakhstan enters global rare earth metals arena; How Kazakhstan’s female entrepreneurs leading Central Asia’s tech revolution - Qazinform",
  "url": "https://qazinform.com/amp/foreign-media-on-kazakhstan-kazakhstan-enters-global-rare-earth-metals-arena-how-kazakhstans-female-entrepreneurs-leading-central-asias-tech-revolution-6486d9/",
  "content": "# Foreign media on Kazakhstan: Kazakhstan enters global rare earth metals arena; How Kazakhstan’s female entrepreneurs leading Central Asia’s tech revolution\n\nBased on recent developments, including Kazakhstan’s deepening cooperation with Turkmenistan as the presidents of both countries conclude high level talks in Astana, the country’s growing entry into the global rare earth metals market, and the rise of Kazakh female entrepreneurs driving Central Asia’s tech transformation, [Qazinform News Agency]( presents a weekly review of foreign media coverage.\n\nAfter wrapping up high-level talks in Astana, Presidents Kassym-Jomart Tokayev of Kazakhstan and Serdar Berdimuhamedov of Turkmenistan came together to sign a Joint Statement focused on boosting their bilateral relations, [Trend.az]( reports.\n\nAmong the key agreements was a Joint Action Plan for Transport Cooperation between the two countries for 2026-2027.\n\nMoreover, the officials from both countries shook hands and put pen to paper on agreements that span a broad spectrum of sectors, touching on cultural exchanges, migration, and healthcare. Notably, the sides agreed on enhanced pension system cooperation and signed a memorandum to advance veterinary services and agricultural research.\n\nKazakhstan’s National Academy of Sciences and Turkmenistan’s Academy of Sciences also agreed to increase research collaboration.\n\nAccording to [The Times of Central Asia]( Kazakhstan, long recognized for its substantial rare earth metals reserves, is moving beyond the familiar characterization of “underutilized potential” and is taking on a more active role in global critical material supply chains. The state-owned mining company Tau-Ken Samruk has become a key driver of this shift, expanding both at home and abroad.\n\nKazakhstan recently confirmed a new deposit with major reserves of cerium, lanthanum, neodymium, and yttrium, strengthening its position as one of the few countries producing more than half of the known rare earth elements. The national strategy now centers on developing a full industrial cycle rather than exporting raw materials.\n\nA clear example of this change came in 2025, when Tau-Ken Samruk signed an agreement with U.S. based Cove Capital to develop the Severny Katpar and Verkhniy Kairakty tungsten deposits. A similar project with China’s Xiamen Tungsten collapsed in 2018 without binding commitments, highlighting growing geopolitical competition around Kazakhstan’s resources.\n\nThe country is also expanding internationally. According to Samruk-Kazyna chairman Nurlan Zhakupov, Kazakhstan aims to process materials from both domestic and foreign sources. “Tau-Ken Samruk is actively engaging with foreign partners,” he said, noting exploration projects underway in Rwanda and Afghanistan.\n\nThese efforts illustrate Kazakhstan’s ambition to secure a larger role in global supply chains. Despite political and security risks abroad, the country continues to pursue long-term partnerships and deeper integration into the rare earth market.\n\nWomen in Kazakhstan are reshaping the tech landscape, entering the sector from diverse backgrounds and driving new forms of innovation, [Euronews]( reports.\n\nA key figure in this movement is Assem Bolatzhan, who shifted from finance to IT in 2015 through the Digital Kazakhstan program.\n\n“We launched the Women in Tech chapter in Kazakhstan because we need to be part of a global community,” she says.\n\nAccording to Women in Tech Astana lead Rinata Ilyubayeva, nearly 60% of women-led startups focus on social impact.\n\n“Most female startups are in EdTech, HealthTech, and solutions for children with autism, elderly people, and pregnant women,” she notes.\n\nThe momentum has led to the creation of Central Asia’s first female-focused venture capital initiative.\n\n“We are building a platform to support women, because it’s not always easy,” says Ilyubayeva.\n\nEntrepreneurs like Aigerim Nurgaliyeva show how women without technical training can succeed.\n\n“The first obstacle was in my mind,” she says. “You can build a startup without coding.”\n\nSCAT Airlines (DV, Shymkent) is considering adding either B777 or B787 aircraft to its fleet for deliveries after 2030, Aviation Week has reported, citing senior marketing manager Zhanar Balgabay.\n\nAccording to [ch-aviation]( data, the Kazakh airline currently has commitments for seven more B737-8s and one additional B737-9.\n\nIts in-house fleet comprises one B737-300, three B737-500s, one B737-700, seven B737-8s, eight B737-800s, five B737-9s, two CRJ200ERs, and two CRJ200LRs.\n\nIn addition, three B757-200s and one B767-300ER are operated by subsidiary Sunday Airlines (Shymkent), which deploys the aircraft on charter services to destinations including Phuket, Dhaka, Moscow Vnukovo, Phu Quoc, and Nha Trang Cam Ranh.\n\nMeanwhile, SCAT Airlines has firmed plans to launch flights from Turkistan to Urgench, Bukhara, and Samarkand by December 2025. The carrier currently serves 40 destinations across 16 countries, operating a total of 61 routes.\n\nKazakhstan wins second straight Asia Championship with win over Japan, Korea beats China to finish second\n\n**IIHF.com: Kazakhstan wins second straight Asia Championship with win over Japan, Korea beats China to finish second**\n\nKazakhstan secured back-to-back titles at the IIHF Ice Hockey Men’s Asia Championship, going undefeated in Beijing with a 3-0 record and a 13-6 goal ratio. Korea finished second, followed by Japan and China, [IIHF.com]( reports.\n\nIn the decisive match against Japan, Roman Starchenko led Kazakhstan with two goals in the second period. After a 1-1 opening frame, Kazakhstan surged ahead with three goals to take a 4-2 lead.\n\nJapan cut the deficit late in the third through Masato Okubo, forcing a tense finish as coach Jarrod Skalde pulled the goalie for an extra attacker. Kazakh goaltender Roman Kalmykov delivered key saves, including a breakaway stop on Kazumo Sasaki and a last second block on Okubo, securing the win and the championship.\n\n[Foreign Mass Media about Kazakhstan]( [Kazakhstan]( [Turkmenistan]( [Central Asia]( [Hockey]( [Critical minerals](  [Tourism]( [Travel]( [Analytics](",
  "weight": "0.9",
  "pickup_count": 4
}