{
  "keywords": "bitcoin",
  "title": "SEC’s Hester Peirce Defends Self-Custody as Bitcoin Holders Shift to ETFs - Cointribune",
  "url": "https://www.cointribune.com/en/sec-leaders-back-crypto-self-custody-as-etf-adoption-reshapes-bitcoin-ownership/",
  "content": "19h30 ▪ 4 min read ▪ by James G.\n\nSelf-custody and financial privacy have returned to the forefront of the U.S. crypto conversation after SEC Commissioner Hester Peirce reaffirmed them as core individual rights. Her remarks come amid regulatory uncertainty, rising ETF adoption, and renewed debate over Bitcoin’s founding principles.\n\n* SEC officials call self-custody a fundamental right, while Congress delays the key crypto market structure bill to 2026.\n\n* Bitcoin holders shift to ETFs, driven by tax-friendly in-kind creations and simpler asset management choices.\n\n* Rising ETF adoption sparks debate as critics say moving away from self-custody weakens Bitcoin’s original purpose.\n\n* PlanB’s move to ETFs adds fuel to community concerns over growing reliance on third-party custodial services.\n\nPeirce, who also leads the SEC’s Crypto Task Force, said on The Rollup podcast that holding one’s own assets should never be questioned in a nation built on personal freedom. According to her, [self-custody]( is a basic human right, and she expressed disbelief that Americans would be expected to rely on intermediaries to safeguard their assets.\n\nShe also stated that privacy should be standard in online financial activity rather than treated as a suspicious choice.\n\nHer comments come as the Digital Asset Market Structure Clarity Act faces further delays. Senator Tim Scott confirmed that the bill, which addresses self-custody, AML rules, and asset taxonomy, has been pushed to 2026. Scott added that the broader effort aims to [empower everyday Americans]( in the growing digital economy. He also noted that lawmakers plan to present a bipartisan draft soon in hopes of delivering it to President Trump.\n\nDuring a June roundtable of the SEC Crypto Task Force, Commissioner Paul Atkins [voiced a similar position]( calling self-custody a core American value. His remarks reinforced Peirce’s stance at a time when industry behavior is shifting.\n\nRising interest in crypto investment vehicles is changing how long-term Bitcoin holders manage their coins. Many whales and early adopters are now moving assets into [exchange-traded funds]( motivated by tax advantages and simpler administration. Dr. Martin Hiesboeck of Uphold reported the first notable decline in self-custodied Bitcoin in 15 years.\n\n* Approval of in-kind ETF creations that avoid taxable events.\n\n* Preference for simpler asset management.\n\n* Growing comfort with regulated investment structures.\n\n* Reduced willingness to maintain private key security.\n\n* Influence of high-profile investors choosing ETFs.\n\nIn July, the SEC allowed in-kind creations and redemptions for crypto ETFs, enabling holders to exchange Bitcoin for ETF shares without triggering tax obligations tied to cash-settled products. Hiesboeck warned that this development moves the industry away from the long-standing “not your keys, not your coins” principle.\n\n[Sentiment in the Bitcoin community]( intensified after PlanB, creator of the stock-to-flow model, revealed in February that he transferred his Bitcoin into ETFs to avoid the burden of managing private keys. His decision sparked strong reactions, with many arguing that surrendering custody contradicts Bitcoin’s purpose as a self-sovereign asset.\n\nMaximize your Cointribune experience with our \"Read to Earn\" program! For every article you read, earn points and access exclusive rewards. Sign up now and start earning benefits.\n\nJames G.\n\nJames Godstime is a crypto journalist and market analyst with over three years of experience in crypto, Web3, and finance. He simplifies complex and technical ideas to engage readers. Outside of work, he enjoys football and tennis, which he follows passionately.\n\nThe views, thoughts, and opinions expressed in this article belong solely to the author, and should not be taken as investment advice. Do your own research before taking any investment decisions.",
  "weight": "0.4",
  "pickup_count": 7
}