{
  "keywords": "tesla",
  "title": "How Solar Flares Could Have Corrupted An Airbus Plane - Gizmodo",
  "url": "https://gizmodo.com/how-solar-flares-could-have-corrupted-an-airbus-plane-2000693690",
  "content": "Airbus recalled thousands of aircraft over the weekend.\n\nAircraft maker Airbus recalled thousands of its A320 family aircraft over the weekend for a software fix, in what has been described as one of the largest directives ever for the company. In an odd twist, radiation from the sun appears to play a central role in these events.\n\nThe A320 recently surpassed the Boeing 737 to become the most delivered jetliner in history, and the recall caused havoc to varying degrees for airlines all around the world. Airbus CEO [Guillaume Faury]( said that the recalls were “causing significant logistical challenges and delays.” Colombian airline [Avianca]( said that the issue had affected more than 70% of its fleet and that it had to close ticket sales for flights through December 8.\n\nThe impact of the recall was less severe stateside. Delta and United reported limited impact on its operations while American Airlines said that all 209 of its aircraft that were impacted had been [issued]( the software fix.\n\nAlthough American air travel was spared from major disruptions, the issue was brought to light after an October incident in which an Airbus A320 operated by JetBlue en route from Cancun, Mexico to Newark, New Jersey suddenly dropped in altitude and had to be rerouted to Tampa, Florida for an emergency landing.\n\nAirbus said in a statement on Friday that the recalls were issued because the company found that intense solar radiation could “corrupt data critical to the functioning of flight controls” in its A320s.\n\nMore specifically, according to an [FAA directive]( the JetBlue flight in October experienced a malfunction in its elevator aileron computer (ELAC), which is a computer that controls the plane’s pitch or nose angle. Airbus believes that solar flares—intense and concentrated streams of electromagnetic solar radiation—may have corrupted the data and caused the ELAC to malfunction, suddenly sending the aircraft plunging down.\n\nThe fix for the issue is a relatively quick revert to earlier software before the planes can fly again, except for some jets that may require a complete hardware replacement.\n\nSolar radiation is a headache for aviation, and the sun has been acting up recently. Back in September, researchers shared that the Sun could be entering an [unexpected active stage]( with a gradual uptick in activity since 2008. Just this past month, the Earth was hit with several violent solar flares, with the NOAA’s Space Weather Prediction Center flagging two of these flares as capable of triggering widespread radio blackouts.\n\nSpace weather expert Tony Phillips [posited earlier this month]( that giant sunspots had been producing solar flares “for weeks” and that there was “no reason to think this activity will subside.” In a [blog post]( on Sunday, Phillips said that a particularly massive sunspot was now “turning to face Earth” and that future sun flares would have the capacity to cause geomagnetic disturbances.\n\nThe region has unleashed at least two powerful solar flares in the last 12 hours, and experts are certain there's more to come.](",
  "weight": "0.7",
  "pickup_count": 0
}