{
  "keywords": "bitcoin",
  "title": "Market News: El Salvador Gets First Self-Custody USDT Visa Card - Live Bitcoin News",
  "url": "https://www.livebitcoinnews.com/market-news-el-salvador-gets-first-self-custody-usdt-visa-card/",
  "content": "[Facebook]( \"Facebook\")     [Linkedin]( \"Linkedin\")     [RSS]( \"RSS\")     [Telegram]( \"Telegram\")     [Twitter]( \"Twitter\")\n\nWe participate in marketing programs, our editorial content is not influenced by any commissions. To find out more, please visit our [Term and Conditions](#) page.\n\nWe participate in marketing programs, our editorial content is not influenced by any commissions. To find out more, please visit our [Term and Conditions](#) page.\n\n[Home]( News]( \"View all posts in Market News\")Market News: El Salvador Gets First Self-Custody USDT Visa Card\n\n[Facebook]( \"Facebook\")[Twitter]( \"Twitter\")[Pinterest]( Jan. 29, Truther launches a USDT Visa card in El Salvador, which is non-custodial. Direct wallets incur a 2% conversion fee when making purchases. No preloading required. \"Pinterest\")[WhatsApp]( %0A%0A  \"WhatsApp\")\n\n***On Jan. 29, Truther launches a USDT Visa card in El Salvador, which is non-custodial. Direct wallets incur a 2% conversion fee when making purchases. No preloading required.***\n\nTruther will transform cryptos in Latin America. During the Blockchain conference in Brazil, the company declared its collaboration with Visa. The card will have a debut launch in El Salvador.\n\nThe product is aimed at travelers and crypto users who want useful solutions. Old-fashioned crypto cards either need to be preloaded or custodial. The innovation of Truther does away with these two requirements altogether.\n\n**You might also like:** [BTC News: El Salvador Makes Largest-Ever Bitcoin Buy With 1,090 BTC Addition](\n\n[CoinDesk]( states that the card deducts USDT at the point of purchase. In the case of the interview at the conference, founder Rocelo Lopes described the process. The users keep full control over their personal wallets.\n\nYou do not charge the card in advance, Lopes said. A 30 euros hotel bill will automatically convert to USDT. The exchange is real-time and has no delays.\n\nThe card currently uses Polygon blockchain infrastructure. Truther intends to migrate to the Liquid network, where privacy is better. Users do not convert crypto into fiat.\n\nAll conversions of currency attract a charge of 2%. Brazilian users are exempt from the IOF tax. All users can access the card after launching.\n\nTruther already handles $40 million in daily volume of transactions. [USDT]( is linked to the PIX payment system in Brazil through the company. Stablecoin payouts to creators and workers were recently piloted by Visa.\n\nThe bitcoin legal tender status in El Salvador presents a perfect experimental environment. Its introduction is succeeded by expansion plans to other parts of Latin America. Other markets will be accessed gradually.\n\nSwapix API by Truther supports real-time crypto-to-fiat transfers. The next in the queue is Argentina. Subsequent rollouts are to Mexico, Colombia, and Russia.\n\nThe choice of the market is based on the availability of a 24/7 payment infrastructure. The support of QR code transactions is vital to operations. [Market]( preparedness is determined by the real-time settlement capabilities.\n\nThe self-custody wallet accepts BTC and USDT at the moment. The Brazilian real-pegged stablecoin Truther is based on Liquid. There are more local integrations of stablecoins in early 2025.\n\nTether Gold will enter the wallet portfolio. A token pegged to Argentine pesos enters development phases. Users are able to use crypto through QR codes.\n\nThere are no network gas fees as recipients obtain stablecoins. The capability increases the ease of use in daily transactions. Conventional banks are considering stablecoin platform integration.\n\nLopes refused to provide any specific details of the bank partnerships. His anticipations are a tripling of stablecoin volumes in twelve months. Conventional financial institutions are fueling the expansion of the ecosystem.\n\n### [XRP News: XRP Set for 10x Rally? 2017 Pattern Repeats]( \"XRP News: XRP Set for 10x Rally? 2017 Pattern Repeats\")\n\n### [Crypto News: a16z Issues Personal Safety Guidelines Amid Rising Crypto Crime]( \"Crypto News: a16z Issues Personal Safety Guidelines Amid Rising Crypto Crime\")\n\n### [XRP News: CoinShares Abandons $870M XRP and SOL ETF Race]( \"XRP News: CoinShares Abandons $870M XRP and SOL ETF Race\")\n\nLiveBitcoinNews is a leading online platform dedicated to providing the latest news and insights about Bitcoin and the broader cryptocurrency market. It offers timely updates on market trends, regulatory developments, technological advancements, and expert analyses, catering to both seasoned investors and newcomers in the digital currency space. The site features a variety of content, including articles, guides, interviews, and opinion pieces, making it a comprehensive resource for anyone interested in staying informed about the rapidly evolving world of cryptocurrencies.",
  "weight": "0.4",
  "pickup_count": 2
}