{
  "keywords": "tesla",
  "title": "E-Bikes Are Surging in Popularity. What Will It Take to Rein Them in? - The New York Times",
  "url": "https://www.nytimes.com/2025/11/30/magazine/e-bikes-accidents-safety-legislation-california.html",
  "content": "![Image 1: A teenager in wide-legged jeans and wearing a backpack sitting on a black electric bicycle with fat tires. Their face is hidden by the hood of their black sweatshirt.](\n\nA high school student on a high-powered electric vehicle known as an e-moto near Tamalpais High School in Mill Valley, Calif.Credit...Balazs Gardi for The New York Times\n\nUnregulated e-bikes are a growing danger on American streets. In one Bay Area town, a terrible accident finally led to reform.\n\nA high school student on a high-powered electric vehicle known as an e-moto near Tamalpais High School in Mill Valley, Calif.Credit...Balazs Gardi for The New York Times\n\nDavid Darlington is a lifelong cyclist who has received a National Magazine Award for public interest for a previous article on traffic laws and bike safety.\n\nIn September 2023,Amelia Stafford was 15 and beginning her sophomore year at Terra Linda High School in eastern Marin County, Calif. An honor student who loved reading, played the trumpet, did well at science and aspired to work for NASA, Amelia often rode her bike to school. Both of her parents — Monica, who works for the Golden Gate National Parks Conservancy, and Scot, an Emmy-winning composer and a founder of the Pollen Music Group — have histories as cyclists: He grew up riding to school in San Francisco, and she commuted to her job on her bicycle across the Golden Gate Bridge. “It was very important to me that my kids grow up learning how to ride bikes,” Scot says.\n\n“I wanted them to get exercise,” Monica adds, so Amelia’s bike didn’t have a motor. In the wake of the pandemic, electric bicycles were proliferating. Many of Amelia’s classmates had gotten e-bikes — or faster machines now known as e-motos — for birthdays and holidays. On a warm Saturday night after a football game, a group of kids was playing around with one.\n\nCoral Billisi, Amelia’s best friend, recalls that Amelia got on the bike behind someone and rode up and down the street. She says it was such a short ride that wearing a helmet didn’t occur to anyone. When the bike toppled over, “our immediate reaction was that we all started laughing — we just thought it was so funny,” she says. “Like, Ha ha, they’re so stupid, they can’t even ride bikes.”\n\nThen they saw the blood on the pavement around Amelia’s head.\n\nCoral, who had taken a CPR course, called 911 and told the others not to touch Amelia. Then she ran to the Staffords’ house and banged on the door.\n\nMonica had gone to bed early. She ran barefoot from the house. When she reached her daughter, Amelia’s eyes were open, but they had rolled back and blood was coming out of her ears. E.M.T.s arrived soon after and transported her to MarinHealth Medical Center, where a CT scan showed bleeding between the skull and the brain.\n\nEnjoy unlimited access to all of The Times.",
  "weight": "0.7",
  "pickup_count": 0
}