{
  "keywords": "tesla",
  "title": "‘Rich Dad Poor Dad’ author drops stark warning on stock market - TheStreet",
  "url": "https://www.thestreet.com/investing/stocks/rich-dad-poor-dad-author-drops-stark-warning-on-stock-market",
  "content": "* ‘Rich Dad Poor Dad’ author drops worrying take on stock market.\n\n* He urges buying into 'God's Money' and digital money.\n\n* Kiyosaki's past crash predictions often failed to materialize but the market debate continues.\n\n“**Rich Dad Poor Dad**” author Robert Kiyosaki just fired off a massive headline-grabbing warning.\n\nThe popular financial commentator says that the “biggest crash in history” is already underway, a dramatic claim, but not entirely an ill-founded one, according to [reporting from MoneyWise](\n\nIt comes at a moment when the [S&P 500]( is hovering near record highs, yet investor worries about an [AI]( bubble remain the elephant in the room.\n\nFor perspective, as of November 28, 2025, the **S&P 500 was at 6,849.09**, nearing its **52-week high of 6,920.34** set in late October.\n\nKiyosaki, though, insists the picture is muddy, pointing to AI-driven [layoffs]( global economic jitters, and what he calls an imminent collapse in both residential and commercial real estate.\n\nIn typical Kiyosaki fashion, his calls are blunt and apocalyptic, but they inevitably spark fleshed-out debates among stock-market pundits.\n\nRobert Kiyosaki is a popular businessman-turned-financial guru, behind the smash-hit 1997 personal finance book “Rich Dad Poor Dad.”\n\nThe book and its spin-offs have collectively sold [**over 32 million copies**]( globally and have been translated into dozens of languages, remaining on bestseller lists for years.\n\nSince then, he’s built an empire of sorts around the Rich Dad brand, organizing seminars, games, and a shelf of follow-ups.\n\nMoreover, Kiyosaki has authored over a couple of dozen books, positioning himself as one of the most popular investors and financial educators of all time.\n\nHis investing mantra primarily leans on [leveraged]( real estate, “**good debt**,” along with cash-flowing assets, and major positions in what he deems “God’s money” (gold and silver), as well as Bitcoin, more recently.\n\nAs for wealth, estimates from *Celebrity Net Worth* peg his [personal wealth at $100 million]( though he’s bragged about being “**over $1 billion in debt**” by design.\n\nRobert Kiyosaki is back at it, saying that a historic market meltdown is underway.\n\nAs per reporting from *MoneyWise*, the “Rich Dad Poor Dad” author posted [a dire message on X]( declaring the “BIGGEST CRASH IN HISTORY STARTING.”\n\nMoreover, he goes on to argue that the downturn isn’t just limited to the U.S. stock market, but also notes that Europe and Asia are showing signs of strain, as AI continues to threaten the loss of millions of jobs.\n\nAdditionally, when jobs disappear, he warns, commercial and residential real estate will follow suit.\n\nHowever, Kiyosaki feels the moment can be both a disaster and an opportunity.\n\nMillions may “lose everything,” but he argues that those who position themselves correctly will come out on the other side.\n\nHis playbook is essentially the same one that he’s been promoting for years.\n\nBuy more gold, silver, Bitcoin, and Ethereum.\n\nHe has even attached some ambitious price targets, predicting that gold could potentially jump to $27,000 and Bitcoin to $250,000.\n\nOn top of that, he feels silver might turn out to be the biggest winner of them all, potentially skyrocketing toward the $200 mark by 2026.\n\nTo be fair, Kiyosaki isn’t the only one spelling out their worries over an AI bubble.\n\n* **[Michael Burry]( (“The Big Short”)**: Has [over a $1 billion bet]( against [Nvidia]( and [Palantir]( via [put options](\n\n* **[Jamie Dimon]( (JPMorgan CEO)**: Says some AI names are already in “bubble territory,” while praising the technology’s long-term potential.\n\n* **Howard Marks (Oaktree Capital)**: Tied today’s AI/Big Tech euphoria to previous manias such as the late-’90s internet stocks.\n\n* **[Stanley Druckenmiller]( (billionaire [hedge fund]( legend)**: Dumped Nvidia and Palantir entirely, locking in gains.\n\n* **Peter Thiel (Thiel Macro / Palantir co-founder):** Thiel Macro’s Q3 13F shows he [exited his entire Nvidia stake](  roughly $100 million worth.\n\nKiyosaki isn’t new to making dire predictions.\n\nFor over a decade, the best-selling author has been issuing sweeping warnings about the stock market’s collapse, currency failure, and runaway [inflation](\n\nOne move from JPMorgan has traders rethinking what comes next.\n\nHis track record, however, has been mostly uneven. Some of them tapped into real anxieties, while others tell a very different story.\n\n* **The long-running “Rich Dad’s Prophecy” crash (2016):** Kiyosaki spent years warning investors that baby boomer retirements could potentially trigger the “biggest crash in history.”  By 2016, he argued that the collapse had begun, blaming China’s slowdown and “Fed insanity.” However, despite the [volatility]( that year, U.S. stocks finished higher, not in shambles as he predicted.\n\n* **The Covid crash that “would keep going” (April 2020):** In the height of the pandemic panic, he laid out that the crash was far from over, urging investors into gold, silver, and crypto. Instead, the S&P 500 ended up posting [nearly a 27% gain]( in 2021.\n\n* **The 2021–2022 “giant crash” and “everything crash”:** [He forecasted an October 2021 wipeout]( warning that stocks, real estate, and crypto could potentially collapse together. Stocks dipped modestly, but Bitcoin and silver dropped significantly more. Over the following year, markets continued to post stronger gains.\n\n* **Hyperbolic targets for gold, silver, and Bitcoin (2023–2025):** From $5,000 gold and $500,000 Bitcoin to gold at $25,000 and [Bitcoin near $1 million]( his calls continue to point northward. Nonetheless, as of late 2025, markets are nowhere in that vicinity.\n\nHere’s what could happen to Nvidia shares next.\n\nMoz (Muslim) Farooque is a financial journalist, U.S. stock and crypto analyst, and founding editor at Undervalued Deep Insights.He specializes in deep dives on AI & emerging tech, electric-vehicle disruptors, big-tech giants, blockchain & crypto markets, and entertainment & media stocks.\n\nDaniel Kline serves as co-editor-in-chief of TheStreet. He has more than 30 years of experience covering retail, restaurants, travel, and technology. He's the creator of Come Cruise With Me, and a noted expert on cruise travel. He has been passionate about the changing state of retail and loves to show why companies succeed or fail.",
  "weight": "0.7",
  "pickup_count": 0
}