{
  "keywords": "tesla",
  "title": "The Strange Time Compression of Sodium-Ion Battery Development - CleanTechnica",
  "url": "https://cleantechnica.com/2025/11/30/the-strange-time-compression-of-sodium-ion-battery-development/",
  "content": "If you are not aware of Chinese battery technical leadership, it is probably time to take notice. As of 2025, [CATL and BYD]( have over 50% of the world’s EV battery market share. From January to September, they accounted for 811.7 GWh. CATL and BYD are not the only battery companies in China. In total, China EV [battery production]( hit 1,122 GWh over the same period, up 44% from the previous year.\n\nWhile the two giants have specialized in LFP and NMC batteries, relatively small Beijing HiNa concentrated on sodium-ion batteries (SIB) used in [JAC]( cars and in other areas, including [utility storage](\n\nHiNa’s inroads have made waves and reverberated throughout the industry. Competition is strong. Sodium-ion batteries have been under development for many years, with a field of competitors globally. [HiNa]( was founded in 2017, and produced sodium-ion batteries from its GWh class factory since November 29, 2022. What is interesting here is that HiNa seems to be lighting a fire under the competitors. HiNa introduced sodium-ion to the utility storage market, providing product for the world’s largest sodium-ion storage system ([a 100 MWh system]( in Nanning, Hubei, in July of 2024, the first stage of a planned 200 MWh system.\n\nThe two largest players are not standing still. BYD broke ground on construction of a 30 GWh sodium-ion factory in January of 2024 and announced sodium-ion products. BYD announced its [MC Cube-SIB]( product, a containerized battery energy storage unit for the utility storage market. BYD has claimed that its system could reduce costs below the HiNa system costs of [$ 0.03/kWh]( CATL’s first-generation sodium-ion battery was released in 2021, at 160 Wh/kg. Late this year, CATL announced the [Naxtra]( battery, with 175 Wh/kg and 10,000 cycle life, with operation from -40°C to 70°C and 90% energy retention at -40°C, offering 500 km (310 miles) of range.\n\nWhile Chinese battery companies announce and ship products, sources claim sodium-ion batteries need further development to compete with LFP. A [Stanford analysis]( early this year of sodium-ion batteries (SIBs) stated that energy density was lower than lithium competitors and would restrain advancement without research breakthroughs. This analysis was picked up and amplified on [social media]( The social media source has an excellent description of SIB operation and technical details, some of which are from SIB researcher and expert [Shirley Meng]( While the warnings of other social media overheated claims are real, CATL Naxtra SIB, BYD MC Cube-SIB, and HiNa Haixing commercial battery announcements seem to contradict the slower rollout expectations. By some measures, those products meet [parity]( [with LFP]( The SIB products are there and perform well compared to LFP, with similar gravimetric energy density and cycle life, but lower volumetric density. However, SIB has superior energy retention at cold temperatures. The expectation in other quarters is that SIB will start to replace LFP. The question remains how much SIB will be produced and when.\n\nWhile the social media fracas has created a flurry of SIB interest and some hype, the real question is what happens next. With considerable investment in sodium-ion battery factories and new product, there is pressure to sell product. Sources agree that the initial best fit for the technology is grid storage, where density is not a factor. There is motivation to build production volume and use that to lower cost.\n\nThe pressure of sodium ion advancement is starting to be felt globally. In Korea, the warning is that battery companies there could lose market share if they do not adopt [sodium]( technology. [LG Chem]( has partnered with Sinopec to develop sodium-ion batteries. Korean battery companies rely heavily on NMC. The BYD Blade battery system showed that LFP can compete with NMC in EVs because it can fit more densely in battery packs, making up some of the difference with NMC. Because of this, LFP batteries are now appearing in some western cars like the [Chevy]( [Bolt]( and recently were in entry-level Teslas. Now SIB are expected to further undercut LFP prices, spurring the two largest battery companies to advance SIB and LG Chem to develop SIBs.\n\nAt the very least, the word in China is that in 2027, the [cost]( of SIB is expected to move toward $0.04/kWh prices typical of LFP. Given lower SIB material and production costs, when that happens, no one will want to be left behind as the inevitable shift to SIB becomes evident.\n\nThe natural progression of battery developments is that at first, only one of a few chemistries can meet application demands, then after the first chemistry does so, later on other lower cost, lower performance chemistries continually advance until they meet minimum requirements. When that happens, the leading chemistry moves up to a higher cost tier with more stringent applications.\n\nThis has happened several times before in EVs, with NCA replaced by NMC, and NMC now by LFP, each supplanting the other at lower costs as the newer entrants advance, meet threshold requirements, and get closer to theoretical performance. While lithium has been dominant for more than a decade, advancements in other chemistries have been expected for many years, with pressure on for lower costs, better low-temperature performance, and safety. Because of the nature of development and application needs at threshold requirements, advancements tend to go unnoticed until threshold requirements are reached. So it was with solar as well, where for many years, it was always too expensive. Then suddenly it wasn’t. It quickly passed parity with fossil fuel generation, and only hydro is cheaper now. The pace in battery chemistry advancements appears slower than semiconductors or solar, but it is steady, and with the level of volume and capital involved now, the necessary investment in research is now producing fruit.\n\nYou can be sure further advances will take place, and each step in advancement causes changes in application. Lithium has opened the market for EVs and grid storage. SIB will push open the market for long-distance electric ships and all ships in general. SIBs will bring electrification market penetration to new levels and new large-scale application, with costs that will sweep away remaining questions of renewable economics and add further pressure to car companies to switch to EVs, cementing batteries as the lowest cost choice. The signs that ICE (internal combustion engine) parity is reached are apparent, with the auto companies waving a [white flag]( pleading for tariffs building an artificial moat against change that will inevitably succumb to progress. Their calls for protectionism belie years of EV development neglect. The changes already happening with solar, wind, and EVs will quicken pace and the cycle will repeat as further market adoption leads to further investment in cleantech. The economic excuses are melting away as the losers clinging to fossil fuels get left behind.\n\n*Sign up for [CleanTechnica's Weekly Substack for Zach and Scott's in-depth analyses and high level summaries]( sign up for [our daily newsletter]( and [follow us on Google News](\n\n*Have a tip for CleanTechnica? Want to advertise? Want to suggest a guest for our CleanTech Talk podcast? [Contact us here](\n\n*Sign up for our daily newsletter for [15 new cleantech stories a day]( Or sign up for [our weekly one on top stories of the week]( if daily is too frequent.*\n\n### Share this story!\n\n* [Click to email a link to a friend (Opens in new window) Email](mailto:?subject=%5BShared%20Post%5D%20The%20Strange%20Time%20Compression%20of%20Sodium-Ion%20Battery%20Development&body=https%3A%2F%2Fcleantechnica.com%2F2025%2F11%2F30%2Fthe-strange-time-compression-of-sodium-ion-battery-development%2F&share=email&nb=1)\n\nhas studied wind, electric vehicles, and environmental issues. An electrical engineer familiar with power and electronics, he has participated in the Automotive X Prize contest. He is an avid writer, specializing in electric vehicles, batteries, and wind energy.",
  "weight": "0.7",
  "pickup_count": 0
}