{
  "keywords": "rare earth",
  "title": "The Capital Crunch: VHM enters last stage of financing - Mining.com.au",
  "url": "https://mining.com.au/the-capital-crunch-vhm-enters-last-stage-of-financing-package/",
  "content": "A number of resources companies announced capital raises to end the last week of November, including [VHM]( (ASX:VHM), which opened a share purchase plan to raise $1 million, following its $10.3 million placement to fund exploration at the Goschen Project in Victoria.\n\nShares will be issued at $0.35 each, which is the same conditions as the placement.\n\nVHM closed its placement on 24 November to fund early engineering works, finalise land acquisition, and operating costs ahead of offtake and financing arrangements for a final investment decision, due in H1 2026.\n\nVHM is a mineral explorer focused on developing its Goshchen Project to produce rare earths and mineral sands.\n\n[Zeotech]( (ASX:ZEO) has received a refund of $960,762 cash from the Australian Government’s Research and Development (R&D) Tax Incentive Program for the financial year ending 30 June 2025.\n\nThe company received this cash payment in regards to development of its metakaolin research for low-carbon cement and concrete from the Toondoon Kaolin Project, located 20km south of Mundubbera, Queensland.\n\nThe refund also covers Zeotech’s proprietary mineral processing technology for the production of zeolites, as well as controlling methane emissions produced in field trials and the development of technology.\n\nZeotech, which has a market capitalisation of $168.53 million, repaid a $1 million loan for R&D activities on 31 October 2025, which was first secured in March 2025.\n\nThe Australian Government’s R&D Tax Incentive Program refunds Australian companies for eligible activities to support local innovation.\n\nZeotech is focused on leveraging kaolin resources to produce high-reactivity metakaolin for the concrete market and advanced materials for greenhouse gas mitigation.\n\n[Surface Metals]( (CSE:SUR) has closed its first tranche of a C$800,000 ($1.22 million) non-brokered private placement.\n\nThe company received C$320,000 in the first tranche, issuing 1.6 million units at C$0.20, with each unit comprising one share and one-half purchase warrant.\n\nEach whole warrant allows the holder to purchase one additional share at C$0.40 over a two-year period.\n\nAs [reported]( by *Mining.com.au*, proceeds will be used to fund technical work at the Cimarron Gold Project, as well as the Clayton and Fish Lake Valley lithium projects, all located in Nevada, US.\n\nSurface Metals is a gold and lithium explorer focused on acquiring and developing projects in North America.\n\nMaddison is a recent journalism and business graduate with a passion for crafting impactful stories. Outside of reporting, she is either working towards her Master’s, working on personal writing projects, or getting lost in a good book.\n\n## Hear It First!\n\nGet the latest Mining news delivered straight to your inbox.\n\nWe use cookies to ensure that we give you the best experience on our website. By clicking Ok and using this site you agree to our use of cookies. Please consult our privacy policy for more information on the cookies we use.[Ok](#)Privacy policy",
  "weight": "0.9",
  "pickup_count": 3
}