{
  "keywords": "rare earth",
  "title": "Gold price to reach new highs in 2026: Goldman poll - Mining.com",
  "url": "https://www.mining.com/gold-price-to-reach-new-highs-in-2026-goldman-poll/",
  "content": "[Frédéric Tomesco](/external-author?author=Frédéric Tomesco) | November 30, 2025 | 6:25 am  [Markets]( [Gold](\n\nGold bullion. Credit: Adobe Stock / photobc1.\n\nAlmost 70% of global institutional investors expect gold prices to post additional gains next year, Goldman Sachs said, citing the conclusions of a new poll.\n\nThe biggest proportion of respondents — 36% — think [gold will top $5,000 per oz.]( by the end of 2026, New York-based Goldman said Friday. Another third of participants said they expect the precious metal to trade between $4,500 and $5,000 over the same timeframe, while just over 5% of those polled see prices dropping to between $3,500 and $4,000.\n\nThe investment bank surveyed more than 900 clients on its Marquee platform from Nov. 12 to 14.\n\nBuoyed in part by sustained central buying and expectations of interest-rate cuts, prices for the yellow metal have set multiple records this year, outperforming virtually every major asset class. With a year-to-date gain of about 61% to $4,223.36 as of Friday afternoon, gold is on course for its third-straight year of double-digits gains. It broke through the $4,000 mark for the first time last month.\n\nCentral bank buying of gold – picked by 38% of respondents – was seen as the main driver of gold’s increase in 2026, Goldman said. Fiscal concerns, with 27% support, ranked as the second-biggest factor.\n\nThe structural forces driving gold are far from exhausted, Sprott Asset Management argued in its November 2025 Precious Metals Report. It described how investors are exiting assets like bonds denominated in dollars and stocks vulnerable to currency devaluations towards precious metals and cryptocurrencies.\n\nGold is now in a multi-year bull market, Daan Struyven, Goldman’s co-head of global commodities research, [said in a podcast]( recorded Oct. 27. He sees the metal hitting $4,900 by the end of 2026 because “most of the rally year to date, or in fact over the last few years, is by sticky purchases, especially of central banks. We think they will continue to diversify into gold.”\n\nOther Wall Street firms share that optimism. JPMorgan Chase sees gold topping $5,055 [in the final quarter of 2026]( while Morgan Stanley projects the metal will hit $4,400 by the end of next year.\n\n***Sponsored:*** *Secure your wealth today — buy gold bullion directly through our trusted partner, [Sprott Money](\n\nNo comments found.\n\n[Pilot project represents a shift in the region's logistics and transport sector, moving from diesel reliance toward clean energy solutions.](\n\n## Your Rankings.\n\nThe new Mining Power Rankings are live. Vote for the sector’s leaders in each of the Large-, Small-, and Micro-Cap leagues.",
  "weight": "0.9",
  "pickup_count": 0
}