{
  "keywords": "tesla",
  "title": "This Early Cyber Monday Deal Cuts the 15-Inch M2 MacBook Air to 40% Off - Lifehacker",
  "url": "https://lifehacker.com/tech/m2-macbook-air-stacksocial-black-friday-early-cyber-monday-deal-2025",
  "content": "It's Mac power without the MacBook Pro price tag.\n\nWe may earn a commission from links on this page. Deal pricing and availability subject to change after time of publication.\n\nPradershika Sharma is a tech deals writer for Lifehacker.\n\n*Black Friday sales officially start Friday, November 28, and run through Cyber Monday, December 1, and Lifehacker is sharing the best sales based on product reviews, comparisons, and price-tracking tools before it's over.*\n\n* *Browse [our editors’ picks]( *for a curated list of our favorite sales on laptops, fitness tech, appliances, and more.*\n\n* *Sales are accurate at the time of publication, but prices and inventory are always subject to change.*\n\nThe 2023 15-inch M2 MacBook Air is currently [on sale for $769.99 at StackSocial]( \"open in a new window\") for the 256GB SSD model. That’s a steep drop from its original price for what is still a current and capable machine. With an 8-core CPU, a 10-core GPU, and Apple’s M2 chip inside, this MacBook handles most day-to-day tasks with ease. Web browsing, photo editing, app switching, and light video work all feel smooth and quick, and the 15.3-inch Liquid Retina display is bright at 500 nits, supports a wide P3 color gamut, and offers sharp resolution at 2880x1864. If you’ve been using a smaller screen or an older laptop, the difference is noticeable.\n\nThe M2 MacBook Air offers up to 18 hours of battery life for video playback or 15 hours for web use, so it’s built for long stretches without needing a charger, though your mileage may vary depending on use. The port selection includes MagSafe 3 for charging and two Thunderbolt/USB 4 ports, which cover most use cases but does mean you'll likely need adapters for more complex setups. The six-speaker system is surprisingly full for a laptop this size and supports Spatial Audio, which pairs well with the 1080p FaceTime camera and three-mic array for video calls. Bluetooth 5.3 and wifi 6 round out the connectivity, keeping everything modern. And while the 8GB RAM and 256GB SSD will suit general use, creatives or heavier users might prefer upgrading to the 512GB, 1TB, or even 2TB configurations, which are also discounted on StackSocial at the moment.\n\nSince it’s a pre-owned device, this unit comes with a Grade A refurbished rating, which means you’re getting something that may (or may not) have a few tiny scuffs, but nothing that affects performance. It also includes a 30-day parts and labor warranty, just in case. You won’t get macOS preinstalled in every case, but the device can be updated to the latest macOS Tahoe 26. If you want a larger MacBook with modern power but don’t want to spend over $1,000, this is [one of the more balanced deals you’ll find]( \"open in a new window\"), especially considering it’s less than half the price of a new 15-inch MacBook Pro.\n\n## How long do Cyber Monday deals really last?\n\nBlack Friday sales officially begin Friday, November 28, 2025, and run throughout “Cyber Week,” the five-day period that runs from Thanksgiving through Cyber Monday, December 1, 2025. But Black Friday and Cyber Monday dates have expanded as retailers compete for customers. Expect sales to wind down by December 3, 2025.\n\nWhat do you think so far?\n\n## What stores have the best sales on Cyber Monday?\n\nNowadays, both large retailers and small businesses compete for Cyber Monday shoppers, so you can expect practically every store to run sales through Monday, December 1, 2025. The “best” sales depend on your needs, but in general, the biggest discounts tend to come from larger retailers who can afford lower prices: think places like Amazon, Walmart, Target, Best Buy, and Home Depot. You can find all the best sales from major retailers [on our live blog](\n\n## Are Cyber Monday deals worth it?\n\nIn short, yes, Cyber Monday still offers discounts that can be rare throughout the rest of the year. If there’s something you want to buy, or you’re shopping for gifts, it’s a good time to look for discounts on what you need, especially [tech sales]( [home improvement supplies]( and [fitness tech]( Of course, if you need to save money, the best way to save is to not buy anything.\n\n## Are Cyber Monday deals better than Black Friday?\n\nBlack Friday used to be bigger for major retailers and more expensive tech and appliances, while Cyber Monday was for cheaper tech and gave smaller businesses a chance to compete online. Nowadays, though, distinction is almost meaningless. Every major retailer will offer sales on both days, and the smart move is to know what you want, use price trackers or refer to [guides like our live blog]( that use price trackers for you, and don’t stress over finding the perfect timing.\n\n[Apple AirPods Pro 3 Noise Cancelling Heart Rate Wireless Earbuds]( \"(opens in a new window)\")   — $219.99  (List Price $249.00)\n\n[Apple iPad 11\" A16 128GB Wi-Fi Tablet (Silver, 2025 Release)]( \"(opens in a new window)\")   — $274.00  (List Price $349.00)\n\n[Dell 14 Premium DA14250 (Intel Core Ultra 7 255H, 512GB SSD, 16GB RAM, 2K Display)]( \"(opens in a new window)\")   — $999.99  (List Price $1,549.99)\n\n[Blink Outdoor 4 1080p Wireless Security Camera (5-Pack)]( \"(opens in a new window)\")   — $159.99  (List Price $399.99)\n\n[Shark AI Ultra Matrix Clean Mapping Voice Control Robot Vacuum with XL Self-Empty Base]( \"(opens in a new window)\")   — $249.99  (List Price $599.00)\n\n[Apple Watch Series 11 (GPS, 42mm, S/M Black Sport Band)]( \"(opens in a new window)\")   — $339.00  (List Price $399.00)\n\n[WD 6TB My Passport USB 3.0 Portable External Hard Drive]( \"(opens in a new window)\")   — $138.65  (List Price $179.99)\n\n[Samsung Galaxy Tab A9+ 10.9\" 64GB Wi-Fi Tablet (Graphite)]( \"(opens in a new window)\")   — $139.99  (List Price $219.99)\n\nGet all the best deals and biggest sales curated by Daniel and the team.\n\nAdd to Cart Newsletter Shop smarter, save more money. Get all the best deals and biggest sales curated by Daniel and the team.\n\nBy clicking Sign Up, you confirm you are 16+ and agree to our  [Terms of Service]( \"(opens in a new tab)\") and [Privacy Policy]( \"(opens in a new tab)\").",
  "weight": "0.7",
  "pickup_count": 0
}