{
  "keywords": "rare earth",
  "title": "Australian miners thrust into spotlight as yttrium rockets 4,000% - Mining.com.au",
  "url": "https://mining.com.au/australian-miners-thrust-into-spotlight-as-yttrium-rockets-4000/",
  "content": "There’s a village on the Swedish island of [Resarö]( in the Stockholm archipelago with residential streets named after chemical elements, such as Ytterbium Road, Terbium Road, and Tantalum Road.\n\nThe streets may seem quiet and unassuming yet this village, called Ytterby, is one of the most important places in scientific history – it’s regarded as the single richest source of elemental discoveries in the world. [Yttrium]( (Y), [terbium]( (Tb), [erbium]( (Er), and [ytterbium]( (Yb) are all named after the village.\n\nOther elements including holmium, gadolinium, scandium, tantalum, and thulium were first discovered there, making Ytterby the richest source of naturally occurring elements on Earth.\n\nBack in 1787, army lieutenant and part-time chemist Carl Axel Arrhenius discovered a strange, unusually heavy black ore in an old quarry near Ytterby. This new ore was named by Arrhenius as ytterbite.\n\nTwo years later, a Finnish chemist identified from Arrhenius’ initial sample the first rare earth element – named yttrium. In just over 50 years following Arrhenius’ original discovery, Carl Gustav Mosander found that ytterbite was actually a mixture of three metal oxides, and a fourth was later discovered by Jean Charles Galissard de Marignac from the original sample.\n\nEventually as refining techniques improved, more new elements were discovered and ultimately over the next 100 years since Arrhenius’ discovery, nine more elements fell out of this strange, unusually heavy black ore.\n\nAmong these hard-to-pronounce elements is yttrium – a soft, grey-white metal that is fairly stable in air but reacts with water, acids, and bases.\n\nIt occurs in other ‘rare earth’ minerals, monazite and bastnaesite, though xenotime, which is mined in China and Malaysia, can contain up to 50% yttrium phosphate, according to the Royal Society of Chemistry.\n\nYttrium metal is produced by reducing yttrium fluoride with calcium metal and is often used as an additive in alloys for its strengthening properties. When alloyed with aluminum, magnesium, and chromium, it acts to strengthen those metals.\n\nIn addition to its applications in speciality alloys found in engines, yttrium is used in coatings to shield against high temperatures.\n\nYttrium oxide is added to glass used to produce camera lenses as it makes them heat and shock resistant. It’s found in white LED lights as well as superconductors and lasers, with yttrium oxysulfide widely sought to produce red phosphors for old-style colour television tubes.\n\nLasers that can cut through metals require yttrium-aluminium garnet (YAG), marking yet another of its many applications in everyday life.\n\nWhile its origins may come from Sweden, like other rare earths and critical minerals, China dominates global production and supply of yttrium. China supplies the US 93% of its yttrium imports, creating acute vulnerability across Western supply chains.\n\nThe world’s supplies are now running low due to Chinese export restrictions, sparking fears of looming protracted shortages, and rocketing costs that could hit every sector from aerospace, to energy and semiconductor production.\n\nOn the back of China restricting yttrium exports (along with six other rare earths in April in retaliation to the US tariffs) yttrium oxide (Y₂O₃) prices have been soaring more than 4,000% in Europe in 2025.\n\nRecently, prices surpassed US$275/kg, as China’s tightening export controls disrupt global supply chains for military and defence, aerospace, semiconductors, and advanced materials. These shortages are also affecting markets related to high-temperature alloys, laser systems, avionics, and defence components.\n\nMagnet rare earth prices also remain high, with Benchmark reporting Dy oxide (DDP China) at over US$200/kg and Tb oxide (DDP China) at almost US$1,000/kg.\n\n[Victory Metals]( (ASX:VTM) CEO Brendan Clark says this global backdrop highlights the company’s strategic positioning as a major future yttrium supplier with what’s emerging as a valuable heavy rare earth basket.\n\nThe company’s current mineral resource hosts over 35 million kilograms of Y₂O₃ with forecast production targets over 600 tonnes annually tonnes along with strategic critical minerals dysprosium, terbium, neodymium and praseodymium, gallium, hafnium, and scandium.\n\nClark says yttrium is emerging as one of the world’s most important critical minerals and this global supply crunch is happening much faster than anyone expected.\n\n*“Our North Stanmore deposit continues to demonstrate the scale, grade, and mineralogy required to supply Western nations with secure, long-term yttrium supply,”* the CEO adds.\n\nVictory is now advancing discussions with multiple strategic partners across the defence, aerospace, automotive, and semiconductor sectors seeking secure non-Chinese heavy rare earth supply.\n\nClark says the surge in yttrium pricing materially enhances Victory’s Prefeasibility Study (PFS), with the company continuing to integrate high value heavy rare earths including yttrium, dysprosium, terbium, and recently confirmed gallium into its economic modelling.\n\nThe CEO recently told shareholders at the company’s AGM that China’s moves to ban the export of key defence-related minerals such as terbium, dysprosium and scandium is an opportunity for Victory Metals to demonstrate its capability to produce these critical materials at scale and to help Australia become a key player in the global energy transition.\n\n*“We expect the PFS will define the processing pathway, costs, and production strategy for the North Stanmore project, and demonstrate how the underlying resources can be turned into a commercial, scalable operation,”* Clark says.\n\nClark notes an exhaustive PFS into Victory’s flagship North Stanmore Project, near Cue in Western Australia’s Mid West region, continues to indicate the project’s potential as one of the most advanced heavy rare earth clay-hosted deposits.\n\n> ***“We are confident we can deliver significant grade increases in terbium, dysprosium and scandium – three of the world’s most valuable and strategically critical elements”***\n\n*“Indications are we can avoid complex cracking or additional capital-intensive processing and environmental impacts, which further strengthens our value as a secure, reliable and capable potential supplier of high-purity feedstock to global processors,”* the CEO adds.\n\n*“With minimal processing under our proposed operating model, we are confident we can deliver significant grade increases in terbium, dysprosium and scandium – three of the world’s most valuable and strategically critical elements.”*\n\nOver the past 12 months, Clark says Victory has attracted strong international and institutional backing, and significant interest from government and private sector defence manufacturers around the world seeking secure off-take agreements.\n\nIn August 2025, the company raised $11.5 million through a placement of new shares to institutional, professional and sophisticated investors.\n\nIn October, Victory signed a non-binding LoI with Japanese trading house Sumitomo Corporation to advance offtake and strategic cooperation for North Stanmore, covering up to 30% of annual production, including up to 50 tonnes of Dy-Tb product over an initial five-year term.\n\nThe Export-Import Bank has also offered an LoI regarding funding support of US$190 million.\n\nVictory Metals is among a number of Australian rare earths explorers thrust into the global spotlight, following the landmark agreement between US President Donald Trump and Australian Prime Minister Anthony Albanese to facilitate the investment of the billions of dollars needed to establish secure and reliable rare earth and critical minerals supply chains.\n\nWith the state of the market, [ABx Group]( (ASX:ABX) has also been ramping up efforts to become a significant player in rare earths space. It’s been raising $6.05 million through a placement to fund development activities at the Deep Leads Project in Tasmania and construction of the ALCORE pilot plant.\n\nFunds will be deployed to engineering and metallurgical studies, exploration drilling for a resource increase, and to secure offtake agreements for the Deep Leads Project.\n\nProceeds will also cover construction and commissioning costs of the ALCORE pilot plant to produce hydrogen and fluoride from aluminium smelter bath waste.\n\nThe Australian Nuclear Science and Technology Organisation ([ANSTO]( has started production of ABx’s first mixed rare earth carbonate (MREC) product using 50kg of a 100kg bulk sample, with completion expected before the end of November 2025.\n\nThe sample will be distributed to potential customers and offtake partners for evaluation.\n\nABx is running a program to produce a saleable MREC product from its Deep Leads ionic adsorption clay rare earth project in Tasmania to be used in downstream refining to produce separated rare earth oxides, REE metals, and magnets essential for EV motors, guidance systems, wind turbines, and other clean-energy technologies.\n\nRare earth refineries (solvent-extraction plants) commonly accept MREC because it’s a standardised, transportable feedstock from which high-purity rare earth oxides and metals can be produced.\n\nIn partnership with external engineering experts, ABx conducted a formal processing options analysis. A key conclusion is that column leach tests should be conducted to confirm that the high extractions obtained in diagnostic leach tests in tanks are also observed in a column leach arrangement.\n\nANSTO is conducting initial column leach tests planned to begin in November, with results available by early 2026.\n\nManaging Director of emerging rare earths producer [OD6 Metals]( (ASX:OD6), Brett Hazelden, believes there is plenty of opportunity for Western countries like Australia to capture a substantial share of the burgeoning market dominated by China.\n\nRecently speaking to *Mining.com.au*, Hazelden says US President Donald Trump is changing the way governments work with private industry, which reshaping how government and private partnerships can work in an investor scheme to bolster Western supply chains.\n\nIf the Western world does not want all roads leading to China, Hazelden argues they need to obviously pay a fair price that allows people to make money but also allows them to participate in the next part of the value chain as well.\n\nThe make-up of OD6’s Splinter Rock Rare Earth Elements Project in Western Australia opens up a plethora of potential end-user avenues for the minnow. The emerging rare earths producer has proven it can produce a clean, high-quality mixed rare earth carbonate, which is a product highly sought after by several end users.\n\nOD6 has now identified another avenue for consideration down the track for the production of samarium and yttrium oxides, which are both used in nuclear reactors for clean power generation and nuclear medicine.\n\nSamarium is also used in the manufacture of high-temperature samarium-cobalt magnets for headphones, electric motors and aerospace applications.\n\nIn early October, OD6 elected a preferred [flowsheet]( with the aim of producing MREC and mixed rare earth hydroxide (MREH). Flowsheet testing undertaken by ANSTO achieved a MREC recovery of about 56% total rare earth oxide (TREO), and a MREH recovery of roughly 59% TREO.\n\nThe process demonstrated low levels of aluminium, iron, phosphorus and silicon impurities, and extremely low uranium and thorium content of less than 0.001%. Overall recoveries of the most in-demand magnet rare earths, neodymium and praseodymium, reached around 75% for OD6.\n\nThe high value magnet rare earths account for 23% of the TREO grade at Splinter Rock, which hosts a resource so far of 682 million tonnes @ 1,338 parts per million for 910,000 tonnes of contained TREO. The magnet rare earths provide about 205,000 tonnes of the contained resource.\n\nMining.com.au Editor-in-Chief Adam Orlando has more than 20 years’ experience in the media having held senior roles at various publications, including as Asia-Pacific Sector Head (Mining) at global newswire Acuris (formerly Mergermarket). Orlando has worked in newsrooms around the world including Hong Kong, Singapore, London, and Sydney.\n\n## Hear It First!\n\nGet the latest Mining news delivered straight to your inbox.\n\nWe use cookies to ensure that we give you the best experience on our website. By clicking Ok and using this site you agree to our use of cookies. Please consult our privacy policy for more information on the cookies we use.[Ok](#)Privacy policy",
  "weight": "0.9",
  "pickup_count": 5
}