{
  "keywords": "bitcoin",
  "title": "Bitcoin Stocks Worth Watching – November 28th - Defense World",
  "url": "https://www.defenseworld.net/2025/11/30/bitcoin-stocks-worth-watching-november-28th.html",
  "content": "[Share on Twitter]( \"Share on Twitter\") [Share on Facebook]( \"Share on Facebook\") [Share on LinkedIn]( \"Share on LinkedIn\") [Share on Stocktwits]( \"Share on Stocktwits\")\n\nIREN, Cleanspark, Cipher Mining, TeraWulf, Marathon Digital, Riot Platforms, and Bit Digital are the seven Bitcoin stocks to watch today, according to MarketBeat’s stock screener tool. “Bitcoin stocks” are shares of publicly traded companies whose business models, assets, or revenue streams are closely tied to bitcoin—examples include miners, exchanges, and firms that hold large amounts of bitcoin on their balance sheets. They give stock market investors indirect exposure to bitcoin’s price and adoption, while also carrying company-specific, regulatory, and operational risks that can cause their performance to differ from bitcoin itself. These companies had the highest dollar trading volume of any Bitcoin stocks within the last several days.\n\nIREN Limited, formerly known as Iris Energy Limited, owns and operates bitcoin mining data centers. The company was incorporated in 2018 and is headquartered in Sydney, Australia.\n\nCleanSpark, Inc. operates as a bitcoin miner in the Americas. It owns and operates data centers that primarily run on low-carbon power. Its infrastructure supports Bitcoin, a digital commodity and a tool for financial independence and inclusion. The company was formerly known as Stratean Inc. and changed its name to CleanSpark, Inc.\n\nRiot Platforms, Inc., together with its subsidiaries, operates as a bitcoin mining company in North America. The company operates through three segments: Bitcoin Mining, Data Center Hosting, and Engineering. It also provides co-location services for institutional-scale bitcoin mining companies; critical infrastructure and workforce for institutional-scale miners to deploy and operate their miners; operation of data centers; and maintenance/management of computing capacity.\n\nBit Digital, Inc., together with its subsidiaries, engages in the bitcoin mining business. It is also involved in the treasury management activities; and digital asset staking and digital asset mining businesses, as well as ethereum staking activities. In addition, it provides specialized cloud-infrastructure services for artificial intelligence applications.",
  "weight": "0.4",
  "pickup_count": 4
}