{
  "keywords": "rare earth",
  "title": "Zijin founder who built the $100 billion Chinese miner retires - Mining.com",
  "url": "https://www.mining.com/web/zijin-founder-who-built-the-100-billion-chinese-miner-retires/",
  "content": "[Bloomberg News](/external-author?author=Bloomberg News) | November 30, 2025 | 5:13 pm  [Careers]( [Top Companies]( [China]( [Copper]( [Gold]( [Lithium](\n\nZijin Mining Group Co.’s founder Chen Jinghe will step down as chairman after steering the company to the upper echelon of global metals miners following a decades-long run of growth.\n\nThe 68-year-old will become honorary chairman and senior consultant for the company after deciding to not accept nomination as a candidate for the board due to age and family reasons, according to an exchange filing on Saturday. The Fujian-based group didn’t name a successor.\n\nZijin’s market value ballooned to [more than $100 billion this year]( for the first time, underpinned by surging prices for its key commodities, especially copper and gold. The company started with a small gold mine in China in the 1980s, and its value is now only surpassed by Rio Tinto Group and BHP Group.\n\nZijin’s competitiveness is “systematic and structural” and the company’s “successful growth story will continue,” Citigroup Inc. analysts including Jack Shang wrote in a note. The bank maintained the miner as a top pick, saying that its copper and lithium assets are undervalued.\n\nA company with enduring success should transit from being “founder-driven” to “institution-driven,” and the management team is mature, making it the best time to transition to a new leadership, Chen said in the statement.\n\nZijin shares rose as much as 6.9% in Hong Kong on Monday alongside other producers of copper after the metal advanced to a record.\n\nNo comments found.\n\n[Almost 70% of global institutional investors expect gold prices to post additional gains next year, Goldman Sachs said, citing the conclusions of […]](\n\n## Your Rankings.\n\nThe new Mining Power Rankings are live. Vote for the sector’s leaders in each of the Large-, Small-, and Micro-Cap leagues.",
  "weight": "0.9",
  "pickup_count": 0
}