{
  "keywords": "tesla",
  "title": "Tianqi keeps door open to international arbitration in SQM fight - Mining.com",
  "url": "https://www.mining.com/web/tianqi-keeps-door-open-to-international-arbitration-in-sqm-fight/",
  "content": "[Bloomberg News](/external-author?author=Bloomberg News) | November 30, 2025 | 8:26 am  [Battery Metals]( [Top Companies]( [China]( [Latin America]( [Lithium](\n\nTianqi Lithium Corp. chief executive officer Frank Ha is keeping the door open to the possibility of taking a case against Chile’s SQM to an international tribunal.\n\nThe Chinese company, a key SQM shareholder, has been arguing that a deal to give state-owned Codelco majority ownership in SQM’s prized Atacama lithium in exchange for three more decades of operations should have [gone to a shareholder vote](\n\n“The treatment we have currently received in this process is undoubtedly frustrating for us as a minority international shareholder,” Ha wrote in written responses to *Bloomberg* questions. Tianqi doesn’t rule out filing for international arbitration, he said.\n\nTianqi’s [fight for a say]( in a transaction involving one of the world’s biggest and most profitable lithium operations has endured [a series of setbacks in Chile]( with authorities there clearing the deal to go through with just boardroom approval. Last week the Chinese firm, which owns 22% of SQM, filed an appeal with Chile’s supreme court.\n\n“This is a matter of corporate governance standards,” Ha wrote. “This is unrelated to the identity of the partner.”\n\nThe SQM-Codelco partnership is a pillar of Chilean President [Gabriel Boric’s agenda]( to have more state control in key lithium assets while boosting output in the transition away from fossil fuels.\n\nThe deal marks Codelco’s entry into lithium production, with the state company set to own 50% of shares plus one after 2030. Until then, SQM will retain operational control.\n\nEarlier this month, China’s antitrust agency [granted conditional approval]( for the partnership, saying the companies must honor existing commercial commitments and continue supplying Chinese customers on a “fair, reasonable and non-discriminatory” basis.\n\nTianqi’s Ha said SQM’s stake remains an important investment and that no decision had been made with regards to its sale.\n\n“Any future decisions will be based on comprehensive financial, legal, and other considerations, fully taking into account the interests of shareholders and stakeholders,” he wrote.\n\nExecuting a transaction that changes control of a listed company’s major asset without shareholder approval “sets a precedent that all international investors must take seriously,” Ha wrote. Tianqi remains confident that “Chile has the capacity to strengthen and maintain the governance standards.”\n\nNo comments found.\n\n[The Canadian miner said on Monday it had reached an agreement with Mali's government to resolve all disputes.](\n\n## Your Rankings.\n\nThe new Mining Power Rankings are live. Vote for the sector’s leaders in each of the Large-, Small-, and Micro-Cap leagues.",
  "weight": "0.7",
  "pickup_count": 0
}