{
  "keywords": "rare earth",
  "title": "This Mining Stock Is Up 385% in 2025. 1 Reason This Could Be Just the Beginning. - AOL.com",
  "url": "https://www.aol.com/articles/mining-stock-385-2025-1-093500725.html",
  "content": "# This Mining Stock Is Up 385% in 2025. 1 Reason This Could Be Just the Beginning.\n\n* TNC The Metals Company is sitting on an extremely valuable reserve of polymetallic rocks.\n\n* The only thing holding it back is obtaining a license to start extracting these rocks from the deep sea.\n\nThe world wants more data centers and electric cars. To build them, it needs materials like copper, nickel, cobalt, and manganese. Most of these metals come from mines that not only tear through forests and leave toxic tailings, but are also very expensive to build and maintain.\n\n**TMC The Metals Company** (NASDAQ: TMC) is pitching a different way to obtain these [metals]( In simple terms, it wants to vacuum rocks that contain these metals (\"nodules\") off the seafloor of the Pacific Ocean.\n\n***Where to invest $1,000 right now?** Our analyst team just revealed what they believe are the **10 best stocks** to buy right now. [**Continue »**](\n\nExcitement about the potential for this company helped boost the stock as much as 854% in 2025; however, the [mining stock]( is down about 49% from all-time highs hit in mid-October. For long-term investors, the underlying idea behind this company could be reason enough to buy this dip.\n\nImage source: The Metals Company.\n\nThe strongest argument supporting TMC's future growth is the combined net value of about $23.6 billion of the metals it expects to extract.\n\nIn August 2025, the company published two technical assessments that assigned that multibillion-dollar value to nodules in its exploratory area. Since the company is still only valued at about $2 billion, that project value gives its dreams some real economic backing.\n\nOn top of that, TMC ended its third quarter with about $115 million in cash, which should give a couple of years of runway with its current [cash burn rate](\n\nThe catch, of course, is that TMC does *not* have regulatory approval to mine the area under its exploratory control. Indeed, although it's been making progress on that front, the concrete steps needed to finally obtain that license are somewhat opaque at this moment.\n\nIf TMC can get through the regulatory process with a valid license to mine the seafloor for nodules, TMC's 385% gain so far in 2025 will be a prologue to something much bigger. Investors who are willing to make that bet could be rewarded, although be warned: This speculative stock will likely get bumpier until the road to mining is clear.\n\n## Should you invest $1,000 in TMC The Metals Company right now?\n\nThe *Motley Fool Stock Advisor* analyst team just identified what they believe are the **[10 best stocks]( for investors to buy now… and TMC The Metals Company wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when **Netflix** made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, **you’d have $563,022**!\\* Or when **Nvidia** made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, **you’d have $1,090,012**!\\*\n\nNow, it’s worth noting *Stock Advisor’s* total average return is 991% — a market-crushing outperformance compared to 192% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join *Stock Advisor*.\n\n*[Steven Porrello]( has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a [disclosure policy](\n\nDon't miss our daily roundup.\n\nStay informed with a handpicked selection of the day's top AOL stories, delivered to your inbox.\n\nThanks for signing up.\n\nThank you for signing up. You will receive a confirmation email shortly.\n\nStay informed with a handpicked selection of the day's top AOL stories, delivered to your inbox.",
  "weight": "0.9",
  "pickup_count": 2
}