{
  "keywords": "bitcoin",
  "title": "Crypto's Most Trusted Stablecoin Given Lowest Possible ‘Weak’ Rating By Major TradFi Agency - Gizmodo",
  "url": "https://gizmodo.com/tether-usdt-sandp-downgrade-2000693464",
  "content": "Trust the dusty old rating agency with the spotty history, or trust the brash young crypto company?\n\nTether’s USDT, the dominant dollar-pegged stablecoin with nearly $185 billion in circulation, just took a hit from traditional finance rating powerhouse S&P Global, as it [downgraded]( its assessment of USDT’s ability to maintain its peg from 4 to 5, which is the weakest score on its associated scale.\n\nS&P originally rolled out its stablecoin rating framework in 2023 to gauge risks like liquidity, governance, and asset backing in the emerging sector. According to their recent report on USDT, Tether’s reserves have shifted toward more volatile holdings over the past year. These perceived riskier assets, such as bitcoin, gold, secured loans, and corporate bonds, now make up 24% of the reserve mix, up from 17% in 2024.\n\nOne of S&P’s sharpest criticisms in its downgrade of USDT lies in its growing reliance on bitcoin in particular as a reserve asset, now comprising 5.6% of the backing, which is well above the 3.9% reserve buffer Tether itself flagged in its latest quarterly report ([PDF]( According to S&P, this exposure amplifies risks tied to bitcoin’s notorious volatility.\n\nS&P also sees serious issues regarding transparency at Tether, as the stablecoin issuer’s attestations offer little more than high-level snapshots, with zero granularity on who holds these assets, how they’re custodied, or what counterparties lurk in the shadows.\n\nThat said, Tether’s reserves still lean heavily on short-term U.S. Treasuries and cash equivalents, accounting for 75% of the reserves. Despite the alleged red flags from S&P, USDT has held its $1 peg through many of crypto’s wild rides over the years, notably handling billions in redemptions without a hitch during the [collapse of crypto exchange FTX](\n\nA Tether spokesperson told *Reuters* the company “strongly disagrees” with S&P’s assessment, which uses an outdated model that ignores USDT’s track record and role as vital infrastructure in emerging markets.\n\n[Tether CEO Paolo Ardoino went further on X]( framing the downgrade as a badge of honor: Tether “wears S&P’s loathing with pride,” thriving as an “overcapitalized” outsider to a flawed legacy system. “The classical rating models built for legacy financial institutions, historically led private and institutional investors to invest their wealth into companies that despite being attributed investment grade ratings collapsed,” Ardoino added.\n\n[In another post]( Ardoino pointed to Tether’s latest attestation [announcement]( where the company also claimed an excess reserve buffer approaching $30 billion; however, this is not explicitly part of USDT’s current reserves.\n\n# Trust S&P or Trust Bitcoin?\n\nIn another post, Ardoino referenced S&P’s failures during the 2008 financial crisis, which were portrayed by a blind woman in the associated film The Big Short. [S&P paid a $1.375 billion settlement]( in a related case with the U.S. Department of Justice regarding allegations that the ratings agency had defrauded investors with its ratings of financial products in the lead up to the housing crisis. Notably, Bitcoin itself was originally launched in January 2009, almost as a direct response to the collapse of trust involved in the financial crisis.\n\nJust weeks before scrutinizing Tether, [S&P also slapped a speculative ‘B-‘ issuer credit rating on bitcoin treasury company Strategy]( highlighting the firm’s $80 billion-plus bitcoin hoard as a vulnerability that could cripple debt payments amid market plunges. The agency’s outlook stays stable for now, but it flags Strategy’s negative cash flow and bitcoin concentration as red flags, much like the volatility risks baked into USDT’s reserves.\n\nWhile S&P sees issues with Tether and Strategy using bitcoin as a reserve asset, many other well-known institutions, such as [the Harvard University Endowment]( and [the state of Texas]( are buying the crypto asset to hold for the long term and find it to be useful as an apolitical, digital store of value.\n\nIt should also be noted that S&P is largely focused on stablecoin issuers’ ability to redeem tokens for dollars in their assessments, so an asset like USDT where the issuer is operating more like a bank issuing its own private currency doesn’t necessarily fit the mold perfectly. In other words, USDT may be viewed negatively by many in the traditional financial system because it is operating on a new standard built on bitcoin rather than the traditional, dollar-based system.\n\n[### U.S. Bank Calls Ability to Freeze Stablecoins ‘Appealing’ as Crypto Has Completely Lost the Plot\n\nThe endowment dramatically increased its holdings of a spot bitcoin ETF since its previous such report.](",
  "weight": "0.4",
  "pickup_count": 4
}