{
  "keywords": "rare earth",
  "title": "Sunday Edition: 30th November - Next Investors",
  "url": "https://nextinvestors.com/articles/sunday-edition-30th-november/",
  "content": "Published 30-NOV-2025 19:05 P.M.\n\n*Disclosure: S3 Consortium Pty Ltd and its associated entities may hold direct or indirect interests in securities referred to in this publication and may receive fees or other forms of consideration from entities mentioned. These interests and arrangements may create a potential conflict of interest in the preparation of this material.*\n\n*The information contained in this communication is provided for general information purposes only and may relate to speculative investments. It does not constitute financial product advice, and has been prepared without taking into account your personal objectives, financial situation or needs. You should consider obtaining independent financial advice before making any investment decision.*\n\nTomorrow’s market open promises to be a very interesting one for silver stocks after silver’s near 6% surge on Friday night post the ASX closing...\n\n(hitting the highest price in its history and delivering a key breakout of a 50 year chart pattern we have been watching...)\n\nHere are all the silver stocks we are Invested in and ones to watch on Monday morning, click on the link to read out Investment thesis for each one:\n\n[SS1](/company/asx-ss1/), [MTH](/company/asx-mth/), [WCE](/company/asx-wce/), [RCM](/company/asx-rcm/), [AVM](/company/asx-avm/), [IVR](/company/ivr/), [BKB](/company/asx-jby/) - also now joined by explorer [PFE](/company/asx-pfe/).\n\nYou can read in more detail on the significance silver’s Friday surge and technical breakout in our Saturday note:\n\nIn this note we also wrote about why we think there will be a rally in small ASX stocks into the Christmas break.\n\nBelow is a summary and links for **everything else** we wrote about last week, along with some other interesting content we found in relation to our Portfolio.\n\n**LKY** appointed [**Lockheed Martin strategy and risk manager**](/quick-takes/lky-adds-lockheed-martin-exec-to-its-advisory-board/), Stacy Newstead, to its advisory board.\n\n*Stacy joins ex-Major General Peter Lambert as appointments to LKY’s team - both with existing networks into the US military industrial complex.*\n\n*LKY is also advancing a white paper for “critical minerals into defence pathways” under the Defense Production Act. (aka government funding prep work)*\n\n**LKY** also kicked off pre-drilling work on its US rare earths project, and will follow that up with drilling of its antimony project. LKY is anticipating a ‘[**continuous flow of exploration news and data through Q1 and Q2 of 2026**](\n\n**WCE** hit silver in [**5 out of 8 zones**](/quick-takes/wce-hits-visible-silver-at-the-elizabeth-hill-mine-in-wa/) from its latest diamond drillholes.\n\n*The results were from handheld XRF readings - so we will need to wait for final assays from these holes (due in mid-December).*\n\n**BPM** released an update on [**its rare earth project**](/quick-takes/bpm-samples-rare-earth-oxide-grades-up-to-965-in-wa/) in WA.\n\n*Rock chips grading up to 9.65% TREO, within a newly confirmed 5km of mineralised strike... but most importantly, the same type of rocks that Iluka is looking to feed through its WA refinery that is under construction.*\n\nThe bigger news from **BPM** this week was that it [**raised $3.5M to help expand and accelerate drilling**](/quick-takes/bpm-raises-funds-drilling-on-wa-gold-asset-to-start-in-few-days/) at its WA gold project (*which should start in the coming weeks*).\n\n**ILA** was [**added to the Medical Countermeasures Coalition**](/quick-takes/ila-added-to-a-coalition-of-companies-which-includes-multi-billion-dollar-big-pharma-companies/) (MC2) to advance US procurement and stockpiling opportunities.\n\n*Some interesting names make up that coalition, including a few who have a proven track record developing drugs that went onto get big US stockpiling deals.*\n\n**PNN** announced [**results from a drill program**](/quick-takes/pnn-now-weeks-away-from-10000m-drill-program-on-brazilian-rare-earths-asset/) on its Brazilian rare earth project.\n\n*The results were from a shallow auger program, and delivered further high grade niobium and rare earths results...*\n\n*Next PNN will kick off the first phase of a 10,000m RC drill program (due to start in December) ahead of a “maiden resource in Q1-2026”.*\n\n**SGQ** hit [**extensions to its already large rare earths resource**](/quick-takes/sgq-hits-extensions-to-the-biggest-rare-earths-resources-deposit-in-south-america/) in Brazil.\n\n*SGQ has 3 rigs drilling 24/7, 29 assays in the lab and 40 more holes planned... so we should see more good news like this week’s results over the coming weeks/months.*\n\n**KAU** is looking at ways [**to get more feed**](/quick-takes/kau-to-drill-waste-dumps-next-to-victorian-processing-plant/) through its processing plant in Victoria...\n\n*One of those had samples with grades of 0.86g/t, the other 1.8g/t... both very processable grades especially so close to KAU’s Victorian plant and an all time high gold price.*\n\n**ION** raised $4.4M to “*Advance E-Waste Recycling Opportunities in the USA*”.\n\n*We participated in ION’s capital raise - we especially liked that there was almost no discount to the market price AND the board participated in the round (both good signals for a capital raise).*\n\n**LSR** started its [**first exploration program**](/quick-takes/lsr-starts-exploration-on-us-heavy-rare-earths-project/) on its project in Arizona.\n\n*Previous sampling at LSR’s project showed 0.53-1.26% TREO, importantly with ~57% heavy rare earths (the valuable ones).*\n\n*The big win for us will be if LSR can show those same grades are consistent across a bigger part of its project.*\n\n**SS1** [**released another drill result**](/quick-takes/ss1-hits-silver-and-gold-26m-above-its-existing-480m-ounce-silver-equivalent-resource/) from its 2025 drill program.\n\n*The kicker for us was that mineralisation in the assay results started a lot closer to surface compared to where SS1’s resource estimate begins.*\n\n*Near surface results could be a game changer for SS1’s project, removing all of the risks related to pre-stripping a deep orebody (i.e. mining the waste rock above the existing resource).*\n\n**HAR** [**completed its second round of drilling**](/quick-takes/har-completes-drilling-on-gold-project-assay-results-coming-next-month/) on its gold project in Senegal.\n\n*HAR is following up the results from a few months ago including the 20m intercept grading 6.54g/t gold.*\n\n*HAR is moving very quickly here (which always makes us pay a lot more attention) and has already committed to deeper RC/diamond drilling in early 2026.*\n\nThis week **HAR** also [**confirmed a drill rig is on site**](/quick-takes/har-to-start-drilling-on-us-gold-project-today/) at its US based gold project in California **AND that drilling was scheduled to have started on the night shift of Friday 28th November.**\n\nThe goal is to convert the current resource to JORC compliant, and HAR expects to complete this by late January 2026.\n\n**TTM** [**released more drill results**](/quick-takes/ttm-results-set-to-add-to-resource-as-lingbao-prepares-for-another-visit/) from its 3.1Moz gold and 22Moz silver project in Ecuador.\n\n*More interesting to us though was the confirmation, strategic investor Lingbao was “preparing a second site visit” as part of its due diligence toward doing a potential project level transaction with TTM for the Dynasty Gold Project.*\n\n**88E** put out an [**update on its projects in Alaska**](/quick-takes/88e-to-flow-test-well-next-to-711m-neighbour/), USA.\n\n*88E is fully carried for all costs associated with an upcoming horizontal well and extended flow test. 88E’s farm in partner is Burgundy Xploration, who is gearing up for an IPO in the US to support operational spend.*\n\n**MNB** provided an [**update for its Cabinda phosphate project**](/quick-takes/mnb-update-on-angolan-phosphate-project/) in Angola.\n\n*IF the alternative structure can be pulled off, MNB could be fast-tracking first production by simplifying its processing flowsheet, removing crushing, drying, and dust extraction to cut ~$20M in CAPEX and $17/t operating costs.*\n\n*There is a fair bit to go through the announcement - Long story short, there looks to be a delay in the first production date mentioned months ago.*\n\n**TG1** [**identified unmapped historical workings**](/quick-takes/tg1-finds-unmapped-historic-workings-on-recently-acquired-project/) at its Dalgaranga Gold Project in WA.\n\n*TG1’s new project sits in a relatively well understood part of WA so it was a surprise to find unmapped historic workings. - a small open pit mined at 2.5g/t gold and multiple shallow workings.*\n\n*Usually these historic workings are found on remote sites - so we liked that announcement from TG1.*\n\n**L1M** [**raised $2.5M to fund drilling**](/quick-takes/l1m-raises-25m-exploration-programs-to-start-early-next-year/) on its QLD and NSW assets.\n\n*We participated in the raise and we are looking forward to Phase 2 of L1M drilling its Queensland gold asset, following up the encouraging mineralisation it hit during Phase 1 drilling in recent months.*\n\n**EIQ** has developed (and is already in the market with) an AI-powered algorithm that helps cardiologists detect heart diseases.\n\nEIQ’s tech is already USA FDA approved AND being used by a growing number of hospitals in the USA to detect one heart disease called Aortic Stenosis.\n\n**Earlier this week EIQ announced results of a clinical validation study on a different heart disease - Heart Failure.**\n\nHeart Failure is one of the big heart diseases - US$60BN is spent on it, 1 in 4 Americans will get it, and it's the leading cause of rehospitalisation.\n\nEIQ’s clinical validation study was run by the prestigious Mayo Clinic. The study delivered exceptional results on **detecting heart failure with 99.5% sensitivity and 91.0% specificity** ([source](\n\nMuch better than the only other AI heart failure detection software used in the market today which delivers **sensitivity of 87.8% and specificity of 81.9%** ([source](\n\n(Both technologies are a step change from current practices where only 50% of Heart Failure cases are accurately diagnosed.)\n\nIF EIQ can get FDA approval for its Heart Failure AI model, there already exists a reimbursement code the company can use to commercialise its AI tech.\n\nThe reimbursement code exists thanks to Ultromics (who [raised US$55M]( in a series C funding round valuing them at US$300M / A$464M back in July).\n\nNow we watch for FDA clearance...\n\n**IIQ** is developing an exosome platform technology.\n\nIIQ is applying its exosome platform to develop diagnostics (detecting diseases) AND therapeutics (treating diseases).\n\nExosomes are tiny, microscopic extra-cellular “containers” that carry ‘messages’ between the human body's cells that allows the human body to function.\n\n**IIQ is going after two types of cancer that have NO approved/recommended treatments or diagnostic tools.**\n\n* Ovarian cancer is usually asymptomatic (no symptoms) in the early stages of the disease. If a woman is diagnosed at stage 1 - the survival rates can be over 90%. If a woman is diagnosed at stages 3/4 survival rates can be ~29%. ~70% of all ovarian cancer in Australia is diagnosed as advanced [stage 3 or 4 cancer](\n\n* At the moment there are no recommended screening tests for women who show no symptoms of ovarian cancer - meaning there is no quick and easy screening test that can be regularly taken by all healthy women to catch ovarian cancer early.\n\n* **IIQ’s screening test has been able to detect all stage 1 and 2 ovarian cancers (the earliest but asymptomatic stages where survival rates are the highest), with over 99.6% specificity (catching 99.6% of all patients with cancer) AND NO misdiagnosis.**\n\n* **What’s Next:** IIQ to do a larger clinical validation study (to see if the test works on a larger cohort of patients) then look at “strategic partnering” to commercialise the screening tool.\n\n* Triple negative breast cancer is an aggressive type of breast cancer that does NOT respond to traditional breast cancer therapies.\n\n* At the moment, there are no approved cell therapies treating triple negative breast cancer.\n\n* IIQ is developing the therapeutic under a deal signed with the prestigious Peter MacCallum Cancer Centre (Peter Mac) in Melbourne. The institution is among only a handful globally that combines a dedicated cancer hospital with a fully integrated cancer research program.\n\n* **So far IIQ has shown that its therapeutic was able to kill more than 90% of the cancer cells within 10 hours of treatment in in vitro studies (in a laboratory setting).**\n\n* **What’s next:** Next for the therapeutic is the results from animal studies (in-vivo) due this quarter.\n\nWe think that any solid tumour therapeutic IIQ is able to develop could be a game changer for the company.\n\nMainly because it would de-risk IIQ’s platform tech (if it works for one cancer, why wouldn't it work for others?)...\n\nWe called **BKB** our 2025 Next Investors Small Cap Pick of the Year because it acquired 100% of a previously producing, high grade silver project, in Texas, USA.\n\nWhile it sits in Texas USA, geologically, it actually sits on Mexico’s famous Sierra Madre belt, which is home to some of the world’s biggest silver producers.\n\n**We want to see BKB get this project back into production as quickly as possible, while silver prices are at all time highs** (we think the silver price could go on a generational run over the coming years and have positioned our Portfolio for this scenario).\n\nAND in the nearer term, we want to see the BKB team execute on their plan to restart their silver mine and processing plant in Texas while drilling out to grow their in ground silver resource.\n\nThis week BKB announced high grade rock chips OUTSIDE of the existing silver resource (grades up to 3,100 g/t silver):\n\nSilver gapped up almost 10% this week so all eyes on the open for this one tomorrow.\n\n**EXR** is the biggest net acreage holder in the Taroom Trough - second only to supermajor $320BN Shell.\n\nEXR just did a deal with the #3 landholder in the region - Omega Oil and Gas.\n\nOmega took a 19.43% position in EXR in exchange for $13.9M at 4.1c per share.\n\nOmega is backed by Tri-Star (pioneers of the Queensland gas industry) and it recently did a deal with ~$2.8BN Beach Energy.\n\nAfter all is said and done EXR will have a $35.3M capital budget to work with.\n\nAND next, EXR is drilling a vertical well targeting a ~1 trillion cubic feet of contingent gas resource (estimate).\n\nDrilling starts in January...\n\nAnd then a horizontal section, with stimulating and testing will follow straight after.\n\nIt all kicks off on the 12th of January according to the EXR MD and CEO Stuart Nicholls in a webinar a few days ago. ([Source - watch it here](\n\nWe also noticed that were two specific conditions as part of Omega’s investment in EXR.\n\nFirst the “standstill” - which means Omega can’t buy any more shares in EXR for at least 12 months - basically EXR is given a 12-month period to deliver material catalysts (like the Lorelle drilling and horizontal well)...\n\nAnd second, the support condition - which basically means if EXR were to attract a takeover offer within the next 12 months from someone OTHER THAN Omega, Omega wouldn't be able to block the transaction (UNLESS they are willing to match/beat the proposal).\n\nWe think this is a very good deal for EXR shareholders, especially if the January drill results come in...\n\n**After this week’s deal, the clear front runners in the Taroom Trough are EXR/Omega and then $320BN Shell...**\n\n**Bloomberg -** While stablecoins are set on revolutionising payments, [**200-year-old lessons from America's free-banking era**]( could determine whether they survive real-world financial stress.\n\n**Bloomberg -** Global silver market tightens as [**China’s stockpiles plummet to decade-low**]( record exports surge, and near-term prices climb in backwardation.\n\n**Bloomberg -** Beijing [**mixes trade power and diplomacy at G-20**]( curbing rare earth exports while rolling out a new international mining initiative.\n\n**Mining.com -** [**US backs Brazil’s Serra Verde**]( with $465M funding to boost rare earth production, cutting Western reliance on China for critical minerals.\n\nThat isn't the first time US capital has made its way into Brazilian rare earths space... good news for our Investment in Brazil [**SGQ**](/company/asx-sgq/).\n\n**Bloomberg -** UK unveils plan to produce 10% of critical minerals domestically and [**recycle 20% by 2035**]( with £50M backing local industry.\n\n*Our Investment* [***ION***](/company/asx-ion/) *is currently getting its foot in the door in the US and has already taken early steps toward doing the same in Europe...*\n\n**Reuters -** EXIM announces [**$100BN investment to stabilize US and allied critical minerals**]( nuclear, and LNG supply chains amid global shortages.\n\n**The Telegraph -** A [**Marburg virus outbreak in Ethiopia**]( has already killed five and is spreading fast near Kenyan and South Sudan’s borders, experts warn of high fatality risk.\n\n*A terrible disease that we hope one day our Investment ILA’s Marburg drug can help tackle:* [***ILA: Our Biotech Pick of the Year***](/articles/ila-our-biotech-pick-of-the-year/)\n\n[***Mithril Silver and Gold (ASX: MTH) - Updated Resource for Silver Gold Project in Mexico Coming in Q1 2026***](\n\n[***Echo IQ (ASX: EIQ) - Investor Briefing: Exceptional Results for EchoSolv HF Validation Study***](\n\n[***One of America’s Biggest Gold Wholesalers Exposes the Most Common Gold Scam Enslaving the Country***](\n\n[**Locksley Resources (ASX: LKY | OTCQX: LKYRF) CEO Kerrie Matthews was on site and getting amongst the flurry of activity underway at its Mojave project in California**](\n\n## A word of caution...\n\nWhile we aim to highlight developments in the small cap space, investing in early-stage and small cap companies - like those we cover - is inherently risky.\n\nThese companies often face funding challenges, regulatory hurdles, and market volatility. Announcements may reflect aspirations more than guaranteed outcomes.\n\nThings can, and often do, change.\n\nJust because a company has signed a deal, released drill results, or appointed a new director doesn’t mean success is assured.\n\nAlways assume delays, cost overruns, or results that don’t pan out.\n\nWe’re here to share insights, not offer personal financial advice - so please do your own research and speak with a licensed adviser before acting on anything mentioned.\n\nBye for now.\n\nThis material has been prepared by StocksDigital. StocksDigital is an authorised representative (CAR 000433913) of 62 Consulting Pty Limited (ABN 88 664 809 303) (AFSL 548573).\n\nThis material is general advice only and is not an offer for the purchase or sale of any financial product or service. The material is not intended to provide you with personal financial or tax advice and does not take into account your personal objectives, financial situation or needs. Although we believe that the material is correct, no warranty of accuracy, reliability or completeness is given, except for liability under statute which cannot be excluded. Please note that past performance may not be indicative of future performance and that no guarantee of performance, the return of capital or a particular rate of return is given by 62C, StocksDigital, any of their related body corporates or any other person. To the maximum extent possible, 62C, StocksDigital, their related body corporates or any other person do not accept any liability for any statement in this material.\n\nS3 and its associated entities may hold investments in companies featured in its articles, including through being paid in the securities of the companies we provide commentary on. We disclose the securities held in relation to a particular company that we provide commentary on. Refer to our [Disclosure Policy]( for information on our self-imposed trading blackouts, hold conditions and de-risking (sell conditions) which seek to mitigate against any potential conflicts of interest.\n\nThe information contained in this article is current as at the publication date. At the time of publishing, the information contained in this article is based on sources which are available in the public domain that we consider to be reliable, and our own analysis of those sources. The views of the author may not reflect the views of the AFSL holder. Any decision by you to purchase securities in the companies featured in this article should be done so after you have sought your own independent professional advice regarding this information and made your own inquiries as to the validity of any information in this article.\n\nAny forward-looking statements contained in this article are not guarantees or predictions of future performance, and involve known and unknown risks, uncertainties and other factors, many of which are beyond our control, and which may cause actual results or performance of companies featured to differ materially from those expressed in the statements contained in this article. S3 cannot and does not give any assurance that the results or performance expressed or implied by any forward-looking statements contained in this article will actually occur and readers are cautioned not to put undue reliance on forward-looking statements.\n\nThis article may include references to our past investing performance. Past performance is not a reliable indicator of our future investing performance.",
  "weight": "0.9",
  "pickup_count": 4
}