{
  "keywords": "tesla",
  "title": "Considering Buying a $20K Home Robot? There's Something You Need to Know First - CNET",
  "url": "https://www.cnet.com/tech/considering-buying-a-20k-home-robot-theres-something-you-need-to-know-first/",
  "content": "This robot is designed to do your chores for you -- but it might need some help from a remote operator.\n\nConnor is a technology writer and editor, with a byline on multiple platforms. He has been writing for around nine years now across the web and in print too. Connor has attended the biggest tech expos, including CES, MWC, and IFA -- with contributions as a judge on panels at them. He's also been interviewed as a technology expert on TV and radio by national news outlets including France24. Connor has experience with most major platforms, though does hold a place in his heart for macOS, iOS/iPadOS, electric vehicles, and smartphone tech. Just like everyone else around here, he's a fan of gadgets of all sorts. Aside from writing, Connor is involved in the startup and venture capital scene, which puts him at the front of new and exciting tech -- he is always on the lookout for innovative products.\n\nThe robot stands 5 feet 6 inches tall, weighs as much as a golden retriever and is nearly the price of a brand-new budget car. This is [Neo]( the [humanoid robot](/tech/computing/a-softer-humanoid-robot-for-the-home/).\n\nBilled as a personal assistant you can talk to and eventually rely on to handle everyday tasks, Neo could load your dishwasher and fold your laundry.\n\nBut it doesn't come cheap: It'll cost you $20,000. And even then, you'll still need to train this new home bot, and it possibly requires remote assistance as well.\n\nIf that still sounds enticing, preorders are now open (for $200 down). You'll be signing up as an early adopter for what Neo's maker, a California-based company called 1X, is calling a \"consumer-ready humanoid.\" That's opposed to other humanoids under development from the likes of [Tesla](/videos/analyzing-the-details-in-teslas-latest-optimus-robot-demo/) and [Figure](/tech/computing/ai-brains-in-a-humanoid-robot-meet-figure-02/), which are, for the moment at least, more focused on factory environments.\n\nNeo is a whole order of magnitude different from [robot vacuums](/home/kitchen-and-household/best-robot-vacuum/) like those from Roomba, Eufy and Ecovacs, and embodies a long-running sci-fi fantasy of robot maids and butlers [doing chores](/tech/services-and-software/ai-and-robots-that-do-your-household-chores-dream-on-folks/) and picking up after us. If this is the future, read on for more of what's in store.\n\n*Don't miss any of our unbiased tech content and lab-based reviews.* [*Add CNET*]( *as a preferred Google source.*\n\nThe pitch from 1X is that Neo can do all manner of household chores: fold laundry, run a vacuum, tidy shelves and bring in the groceries. It can open doors, climb stairs and even act as a home entertainment system.\n\nNeo appears to move smoothly, with a soft, almost human-like gait, thanks to 1X's tendon-driven motor system that gives it gentle motion and impressive strength. The company says it can lift up to 154 pounds and carry 55 pounds, but it is quieter than a refrigerator. It's covered in soft materials and neutral colors, making it look less intimidating than metallic prototypes from other companies.\n\nThe company says Neo has a 4-hour runtime. Its hands are IP68-rated, meaning they're submersible in water. It can connect via Wi-Fi, Bluetooth and 5G. For conversation, it has a built-in large language model (LLM), the same sort of [AI technology](/tech/services-and-software/best-ai-chatbots/) that powers [ChatGPT](/tech/services-and-software/what-is-chatgpt-everything-you-need-to-know-about-the-ai-chatbot/) and [Gemini](/tech/services-and-software/what-is-gemini-everything-you-should-know-about-googles-ai-tool/).\n\nThe primary way to control the Neo robot will be by speaking to it, just as if it were a person.\n\nStill, Neo's usefulness today depends heavily on how you define useful. The Wall Street Journal's Joanna Stern got an [up-close look at Neo]( at 1X's headquarters and found that, at least for now, it's largely teleoperated, meaning a human often operates it remotely using a [virtual-reality headset](/news/best-vr-headset-sem/) and controllers.\n\n\"I didn't see Neo do anything autonomously, although the company did share a video of Neo opening a door on its own,\" Stern wrote last week. 1X CEO Bernt Børnich reportedly told her that Neo will do most things autonomously in 2026, though he also acknowledged that the quality \"may lag at first.\"\n\nThe company's FAQ says that if there's a chore request Neo doesn't know how to accomplish, you can schedule an expert from 1X to help the robot \"learn while getting the job done.\"\n\nPart of what early adopters are signing up for is to allow Neo to learn from their environment, so that future versions can operate more independently.\n\nThat learning process raises questions about privacy and trust. The robot uses a mix of visual, audio and contextual intelligence -- meaning it can see, hear and remember interactions with you in your home.\n\n\"If you buy this product, it is because you're OK with that social contract,\" Børnich told the Journal. \"It's less about Neo instantly doing your chores and more about you helping Neo learn to do them safely and effectively.\"\n\nNeo's reliance on human operation behind the scenes prompted a response from John Carmack, a computer industry luminary known for his work with VR systems and the lead programmer of classic video games, including Doom and Quake.\n\n\"Companies selling the dream of autonomous household humanoid robots today would be better off embracing reality and selling 'remote operated household help',\" he wrote in a [post on the X social network](\n\n1X says it's taking steps to protect your privacy: Neo listens only when it recognizes it's being addressed, and its cameras will blur out humans. You can restrict Neo from entering or viewing specific areas of your home, and the robot will never be teleoperated without owner approval, the company says.\n\nBut inviting an AI-equipped humanoid to observe your home life isn't a small step.\n\nThe first units are expected to ship to customers in the US in 2026. There is a $499 monthly subscription alternative to the $20,000 full purchase price, although it will be available at an unspecified later date. A broader international rollout is promised for 2027.\n\nNeo's got a long road ahead of it to live up to the expectations set by Rosie the Robot in The Jetsons way back when. But this is no Hanna-Barbera cartoon. What we're seeing now is a much more tangible harbinger of change.\n\n* [M2 Mac Mini Review](/tech/computing/m2-mac-mini-2023-review-apple-adds-m2-and-m2-pro-chips-to-this-tiny-desktop/)",
  "weight": "0.7",
  "pickup_count": 0
}