{
  "keywords": "tesla",
  "title": "China's factory activity contracts for 8th month in November despite trade war truce - ABC News",
  "url": "https://abcnews.go.com/International/wireStory/chinas-factory-activity-contracts-8th-month-november-despite-127972585",
  "content": "China’s factory activity contracted for the eighth straight month in November, according to an official survey on Sunday, underscoring challenges for the country’s economy despite the U.S.-China trade truce\n\nHONG KONG -- China’s factory activity contracted for the eighth straight month in November, according to an official survey on Sunday, underscoring challenges for the country’s economy despite the U.S.-China trade truce.\n\nThe official manufacturing purchasing managers index rose slightly to 49.2 in November from 49 in October, China’s National Bureau of Statistics said.\n\nThe PMI is measured on a scale between 0 and 100, with a reading below 50 indicating contraction. The contraction was in line with analyst expectations.\n\nA U.S. tariff cut earlier this month likely would mean that Chinese exports could gain competitiveness in the U.S. market, but it may be too early to say whether exports have regained momentum following the trade truce.\n\nU.S. President Donald Trump said the U.S. would cut its tariffs on Chinese goods after meeting Chinese leader Xi Jinping in South Korea on Oct. 30, raising some optimism over Chinese exports and manufacturing.\n\nA prolonged slump in China’s property market and falling home prices are still hurting consumer confidence, and real estate investments have been down. Intense price competition domestically in many sectors including the auto industry have also put pressure on many businesses.\n\nMore government policy support is required to help boost the economy, economists said.\n\nBut “policymakers appear to be delaying further policy support,” Lynn Song, chief economist for Greater China at ING bank, wrote in a note earlier this month.\n\nWhile Chinese authorities previously rolled out measures such as trade-in subsidies for home appliances and electric vehicles, some of these subsidies are set to be phased out, and sales and demand are likely to drop, analysts said.\n\nThe fading boost from the consumer goods trade-in policies may be weighing on domestic demand for manufactured goods and “signals on domestic demand have been mixed,” said Zichun Huang, China economist at Capital Economics, last week.\n\nChinese officials have set a target of around 5% economic growth for the whole of 2025. The economy expanded 4.8% in the July-September quarter.\n\n“This year’s growth target is likely to require minimal additional support to be reached,” Song wrote.",
  "weight": "0.7",
  "pickup_count": 0
}