{
  "keywords": "rare earth",
  "title": "One discovery that Oriented 2025: 12 Days of Christmas - Mining.com.au",
  "url": "https://mining.com.au/one-discovery-that-shaped-2025-12-days-of-christmas/",
  "content": "As the mining and resources industry winds down for the year and the festive season settles in, [*Mining.com.au*]( is unwrapping a 12-day macro series, exploring the forces shaping the sector.\n\nMuch like the classic carol, each day builds on the last. On the first day we’re diving into one gift that set the tone of the year for critical minerals explorer [Iltani Resources]( (ASX:ILT).\n\nSince June 2023, the company has focused exploration efforts at the Orient deposit near Herberton in Far North Queensland, uncovering its prospectivity to produce silver, lead, zinc, and indium.\n\nEarlier this year, Iltani’s efforts paid off when the company flagged the asset to potentially be one of the *“highest-grade known silver-indium”* deposits, emerging as one of 2025’s brightest lights in critical minerals exploration, as [reported]( by *Mining.com.au*.\n\nThe project comprises two main areas of focus – Orient East and Orient West – within the greater Herberton Project, which spans around 367km2 in the Herberton Mineral Field.\n\nThe combined deposits have returned a maiden resource estimate of 62.5 million tonnes @ 81.5 grams per tonne silver-equivalent at a 30g/t cut-off grade, with a higher grade core of 34.2 million tonnes @ 110.4g/t silver-equivalent with a 60g/t cut-off grade – the kind worth placing under any explorer’s Christmas tree.\n\nOrient East hosts a resource of 19.8 million tonnes @ 98g/t silver-equivalent, with a higher grade core of 12.6 million tonnes @ 128g/t silver-equivalent, as [reported](\n\nOn the return of recent versatile time domain electromagnetic (VTEM) target drilling at the project, Iltani says Orient has demonstrated potential to materially increase the mineral resource.\n\n*Mining.com.au* [reports]( across a 10-hole shallow campaign, the first hole (ORR128) delivered multiple intersections of *“thick”* silver-lead-zinc-indium mineralisation, 450m north of the Orient East resource zone.\n\nMineralisation remains open along strike and down-dip, which is believed to upgrade the resource substantially.\n\nIltani has received its final assay results from VTEM drilling, such as 20m @ 93.8 grams per tonne silver-equivalent (AgEq) from 4m, including 6m @ 132g/t AgEq from 18m; 3m @ 130.9g/t AgEq from 170m, including 1m @ 279.3g/t AgEq from 171m.\n\nThe company is now conducting a surface electromagnetic (EM) survey at the Orient to target deeper anomalies generated by VTEM drilling, as [reported](\n\nSpeaking to *Mining.com.au* on the sidelines of the [Noosa Mining Investor Conference]( Iltani Managing Director Donald Garner says the main revenue drivers for the project are silver, then followed by zinc, lead, and indium in that order.\n\n*“As long as gold sees high, silver will see high,”* Garner tells this news service.\n\nAs the festive season approaches, silver has been enjoying its own holiday cheer, marked at US$49.99 per ounce as of 24 November 2025, indicating a 73.12% for the commodity’s value from this year to date [according]( to Trading Economics.\n\nZinc on the other hand is priced at US$3,010, almost at a 1% increase for this year-to-date.\n\n*“Zinc recently almost touched a dollar fifty a pound, which is really good to see. The Zinc TCs treatment charges are low, which is also good,”* Garner adds.\n\n*“If we are successful with the permitting and development process, we’ll be in production in three or four years’ time.”*\n\nAt the same conference, Garner describes sentiment to be high ahead of the year’s end for miners across different commodities.\n\n*“There’s a resurgence in commodity prices, gold sales in particular, but the base metals are doing well and you’ve got this increasing interest in critical minerals,”* Garner mentions.\n\n*“They want to see mining in the state. They want to see value created in the state, jobs, revenues – it’s a really good time to be working in Queensland.”*\n\nIltani is [receiving]( an $8 million investment from the Queensland Investment Corporation’s (QIC) Critical Minerals and Battery Technology Fund (QCMBTF) to further develop the Orient Project.\n\nThe total grant comprises $6 million in cash in exchange for a 2% royalty on future product sales from the greater Herberton Project if commercial production begins by the end of 2030, otherwise boosting to 2.5%, as well as $2 million cash for the issue of 5.41 million shares.\n\nShares will be issued at $0.37 each, indicating a 10% discount to the 20-day volume weighted average price prior to the agreement.\n\n*“Now with the funding from the QIC, we’ll build on what we’ve got and do more,”* Garner adds.\n\nThe QIC is a state government-owned corporation that manages the QCMBTF to bolster businesses focused on supporting Queensland’s critical minerals supply chain, holding $131.6 billion worth of assets under management as of 30 June 2025.\n\nGarner explains that while the Iltani’s main priority is exploring the Orient Project, the company is always looking for opportunities to *“create value for shareholders”.*\n\n*“If we don’t look, we won’t find and you’ll never know when we’ll come across one of those,”* Garner says.\n\n*“We’re growing the team at Orient to make sure we deliver the best possible project for our shareholders and for Queensland.”*\n\nThe company will focus on drill targets inside the Caldera Complex including the Boonmoo gold and Union Jack base metal targets, before mapping the Orient and Antimony Reward projects.\n\n*“Once we understand the controls of the mineralisation, we might go back to Antimony Reward but our main focus is at Orient,”* Garner tells [*Mining.com.au*](\n\nThe Antimony Reward deposit sits roughly 17km from Orient, also within the Herberton Project in Queensland.\n\nIltani completed initial drilling at the asset in 2024, with assays [returning]( 7m @ 7.61% antimony from 38m, including 3m @ 8.19% from 38m and 1m @ 26.70% from 43m in hole ARRC001.\n\nHole ARRC003 intersected 3m @ 0.75% antimony from 31m, including 1m @ 1.25% from 32m; and 4m @ 0.43%, including 1m @ 1.28% from 42m, while hole ARRC004 intersected 9m @ 0.94% from 53m, including 2m @ 2.66% from 60m.\n\nIltani Resources is a mineral explorer focused on the discovery and development of critical minerals for a clean energy future.\n\nAs day one of *Mining.com.au*’s 12 days of Christmas series comes to a close, Iltani’s discovery highs in 2025 sets the tone for the next year and the next door on our advent calendar.\n\nMaddison is a recent journalism and business graduate with a passion for crafting impactful stories. Outside of reporting, she is either working towards her Master’s, working on personal writing projects, or getting lost in a good book.\n\n## Hear It First!\n\nGet the latest Mining news delivered straight to your inbox.\n\nWe use cookies to ensure that we give you the best experience on our website. By clicking Ok and using this site you agree to our use of cookies. Please consult our privacy policy for more information on the cookies we use.[Ok](#)Privacy policy",
  "weight": "0.9",
  "pickup_count": 3
}