{
  "keywords": "rare earth",
  "title": "High gold prices hit demand across major Asian hubs - Mining.com",
  "url": "https://www.mining.com/web/high-gold-prices-hit-demand-across-major-asian-hubs/",
  "content": "[Reuters](/external-author?author=Reuters) | November 30, 2025 | 8:16 am  [Markets]( [Asia]( [China]( [Gold](\n\nGold demand was subdued across major Asian markets this week, as high prices curbed retail buying even as India entered its wedding season, while in China, the removal of a tax exemption on gold purchases dented consumer appetite.\n\nThis week, Indian dealers were offering a discount of up to $18 per ounce over official domestic prices – inclusive of 6% import and 3% sales levies – narrower than last week’s discount of up to $21.\n\nDomestic gold prices were trading around 126,100 rupees per 10 grams on Friday, up 4.4% from last week’s low of 120,762 rupees.\n\n“Buyers are uneasy with the current high prices, waiting for a correction, which has kept demand very weak,” said Ashok Jain, proprietor of Mumbai-based gold wholesaler Chenaji Narsinghji.\n\nJewellers are also holding off on building stocks [for the ongoing wedding season]( as footfalls at their stores have dropped sharply after surging during the Diwali festival, said a Mumbai-based bullion dealer with a private bank.\n\nWeddings are a major driver of gold purchases in India, with jewellery a key part of bridal attire and a common gift from families and guests.\n\nSpot gold prices climbed on Friday, poised for a fourth straight monthly rise, bolstered by bets on interest rate cuts by the US Federal Reserve in December, while an outage at exchange operator CME Group halted futures trading.\n\nIn top consumer China, bullion traded anywhere from a premium of $1.40 to discounts of up to $16 an ounce compared with the global benchmark spot price.\n\n“People are concerned about the tax (exemption) in China, so trading is still low,” said Peter Fung, head of dealing at Wing Fung Precious Metals.\n\nOn November 1, Beijing [cut a value-added tax exemption]( for certain gold purchased through the Shanghai Gold Exchange and the Shanghai Futures Exchange, a move expected to push up costs for gold used in jewellery and industry.\n\nIn Singapore, gold was sold at par to a premium of $2.50 this week. Gold in Hong Kong traded at par to a premium of $1.80.\n\nIn Japan, bullion was sold at par with spot prices.\n\nNo comments found.\n\n## Your Rankings.\n\nThe new Mining Power Rankings are live. Vote for the sector’s leaders in each of the Large-, Small-, and Micro-Cap leagues.",
  "weight": "0.9",
  "pickup_count": 0
}