{
  "keywords": "rare earth",
  "title": "Exploration funding reaches ‘turning point’ in Australia: report - Australian Mining",
  "url": "https://www.australianmining.com.au/exploration-funding-reaches-turning-point-in-australia-report/",
  "content": "A new report suggests an “aggressive rush of capital” has hit Australia’s exploration sector as governments and investors move to strengthen and diversify critical mineral supply chains.\n\nThe *September quarterly cash update* report, released by professional services company BDO, shows $3.49 billion flowing into the sector as a result of investors and governments moving “more decisively” to [reinforce long-term critical minerals supply capabilities](\n\n“Australia’s traditional September fundraising slump did not materialise, with the quarter instead breaking a decade-long pattern of weakness,” the report said.\n\nThe report marks the first time in four years that explorers have experienced consecutive quarterly [increases in funding]( – going against a “usual downturn” of cash inflow.\n\nThe quarter delivered an 81 per cent rise in funding from June, driven by 78 companies raising more than $10 million each and capturing $2.88 billion of the total inflow.\n\nThese positive numbers have been described as a turning point for exploration in Australia, with the race for strategic resources accelerating at a pace the market has not seen in years.\n\n“The scale of these raisings tells you exactly where global priorities are shifting,” BDO global natural resources and energy leader Sherif Andrawes said.\n\n“Investors are backing assets that matter to energy security, electrification and industrial capability.”\n\nBoth copper and gold performed strongly in the quarter, the report stated, with [gold remaining the largest contributor]( – 21 explorers are said to have raised over $500 million on the back of record gold prices and increased global demand.\n\n[Copper-linked companies]( are also said to have performed strongly, reflecting the metal’s central role in electrification.\n\nExploration spending climbed to $843.66 million, a 16 per cent rise driven by gold and copper explorers. Cash balances rose to an average of $11.02 million, the first lift in a year.",
  "weight": "0.9",
  "pickup_count": 1
}