{
  "keywords": "rare earth",
  "title": "The Rare Earth Metal Driving Tensions Between the US and China - WIRED",
  "url": "https://www.wired.com/story/yttrium-rare-earth-metal-china-us/",
  "content": "Yttrium plays a critical role in everything from aircraft engines to semiconductors. China controls the vast majority of the market—and that’s not changing anytime soon.\n\nThe alarm hasn't yet reached the general public, but tension is beginning to build in the corridors of the aerospace industry, in microchip laboratories, and in government offices. For months, an element almost invisible to the world—yttrium—has become the silent center of a new global dispute. Supplies are thinning, prices are skyrocketing, deliveries are stalling. And while China and the United States have [promised a truce over rare earth minerals]( the wheels of advanced technology are beginning to slow.\n\nAlthough a late-October meeting in South Korea between Chinese president Xi Jinping and his US counterpart Donald Trump raised hopes for a détente, the [Chinese export restrictions]( introduced last April remain substantially in place. Beijing granted a one-year reprieve on the mandatory government licensing system for shipments of rare earths and products containing related materials (including those made abroad with at least 0.1 percent Chinese resources), in exchange for a similar suspension of the White House's latest restrictions on technology supply chains.\n\nBut other measures introduced before the latest escalation remain in place. The result is a tightening of the international supply chain that threatens to slow advanced technological production, raise costs, and challenge entire industrial sectors. Yttrium plays a crucial role in the functioning of contemporary technologies. Without yttrium, the production of aircraft engines, high-efficiency turbines, advanced energy systems, and semiconductors would immediately slow down.\n\nYttrium's value lies in its ability to impart thermal and mechanical strength to materials subjected to extreme temperatures. Jet engines blades, for example, must withstand prolonged overheating and intense vibration; yttrium is what allows them to maintain structural integrity and efficiency. The same is true for industrial chip manufacturing, where yttrium-based coatings protect machinery from chemical wear and ensure precision in plasma etching. Its indispensable nature has made it a key element of modern technology and the military.\n\nThe problem is that, as with several other resources, China controls almost the entire global yttrium supply chain. Not only does it produce most of it, but it also has the know-how and infrastructure to refine and separate it from other rare earth minerals, a complex and technologically advanced process. According to US data, the United States imports 100 percent of its yttrium needs, 93 percent of which comes directly from China. Such stark dependence creates enormous geopolitical vulnerability.\n\nWhen Beijing decided to introduce export restrictions as a response to US tariffs, the entire international supply structure began to falter. Companies reported delays, difficulties in obtaining licenses, and uncertainty about delivery times. In the rare earths trade, lack of predictability is often more damaging than reduced volumes: An industry accustomed to just-in-time deliveries can be thrown into crisis by even a few weeks of delay.\n\nThe effects were immediate. In Europe, yttrium oxide prices have soared, reaching a 4,400 percent increase since the beginning of the year. Aerospace companies, which rely heavily on this material, have expressed alarm and demanded urgent measures from the US government to expand domestic production. The semiconductor industry is no less concerned: Some companies have called the situation a “serious” threat, predicting impacts on costs, efficiency, and production timelines. Gas-fired power plants, which use yttrium in the protective coatings of turbines, are also monitoring Chinese developments with increasing attention, although they maintain that they have not yet experienced disruptions.\n\nThe situation in warehouses outside China adds further layers of complexity. Available reserves, according to piecemeal estimates, range from one to 12 months, depending on the producers. Some traders have already reported running out of material; from quantities in the hundreds of tons range, many are down to just a few units. Others are completely out of stock. This volatility makes the market extremely fragile and underscores how the global supply chain depends on a small number of players.\n\nChinese exports to several countries have fallen by about 30 percent. China, which aims to become an autonomous tech powerhouse, therefore maintains a position of strength and a high degree of discretion, carefully regulating the quantities released to the international market. Moreover, the measures introduced by Beijing in the sector from the outset are flexible enough to allow it to modulate the flow of shipments according to political priorities.\n\nOn the political front, the trade truce between Washington and Beijing has yet to produce concrete results. The two sides have given negotiators until the end of November to outline clearer terms for rare earth exports to the United States, but the gap between their respective priorities remains wide. Beijing continues to work on a licensing system, inspired by mechanisms already used by the United States, that would allow for faster flow only to companies deemed to have no ties to the US military industry. This would leave many Western companies operating in the delicate boundary between civilian production and defense applications at a disadvantage, further complicating access to materials.\n\nChina's strategy involves not only controlling trade flows, but also managing technical expertise internationally. Authorities have begun requiring detailed lists of technicians specializing in rare earths, restricting their travel abroad and monitoring potential transfers of expertise to rival countries. At the same time, bans on the export of advanced rare earth processing technologies continue, a sector in which China holds a leadership position that is unlikely to be replicated in the short term. This dual approach—control of physical resources and human capital—strengthens Chinese primacy and hampers attempts to build an alternative supply chain.\n\nThe United States is nevertheless trying to fight back. New industrial projects, such as that of ReElement Technologies in Indiana, aim to produce yttrium oxide domestically starting in December, with an initial capacity of 200 tons per year, set to double within a few months. While this figure isn't enough to cover total US needs, it represents a first step toward diversification.\n\nDuring Trump's recent visit to Asia, Japan and the United States signed an agreement to jointly exploit the giant Minamitori undersea deposit, discovered years ago in the Pacific seabed. Washington and Tokyo announced the launch of a joint study to develop technologies and infrastructure capable of extracting these strategic materials from extreme ocean depths, a feat that will require enormous investment and advanced technical cooperation.\n\nYet the absence of a complete supply chain—from extraction to refining—makes the transition slow and complex. China has no intention of giving up its dominant position, a crucial and potentially decisive negotiating lever.\n\nTopics[China](/tag/china/)[manufacturing](/tag/manufacturing/)[materials](/tag/materials/)[Metal](/tag/metal/)[trade](/tag/trade/)\n\n*The Fantastic Four: First Steps*, *Thunderbolts\\**, and *Something Wicked This Way Comes* are just a few of the movies you should be watching on Disney+ this month.\n\nGet 10% off your first order at Western Digital when you register your email.\n\nEnjoy up to 50% off deliveries, free meals, and more with the latest Home Chef coupons.\n\nYou can snag a discount on all the Pixel 10 phone varieties if you act fast.\n\nThis $400 set comes with minifigures of the complete Next Gen crew, including Picard, Riker, and Wesley Crusher’s portable tractor beam.\n\nSave hundreds on our preferred MacBook for most people.\n\nAll-Clad cookware is the best you can buy—and it has a price tag to match. This sale will stretch your dollars, but it ends soon.\n\nYou could save hundreds on Razer's sleek gaming laptop with an OLED upgrade.\n\nUpgrade your sleep setup with up to 20 percent off some of our favorite bedding essentials.\n\nMany critical systems are still being maintained, and the cloud provides some security cover. But experts say that any lapses in protections like patching and monitoring could expose government systems.\n\nWIRED obtained notes from a Social Security Administration management meeting, where employees pressed leadership on plans for the agency.\n\nThe interstellar comet 3I/Atlas reached its closest point to the sun. Here's how to follow the rest of its journey away from our solar system.",
  "weight": "0.9",
  "pickup_count": 5
}