{
  "keywords": "tesla",
  "title": "Another EV Charging Hub Running On Renewable Energy Launches In California - CleanTechnica",
  "url": "https://cleantechnica.com/2025/11/30/another-ev-charging-hub-running-on-renewable-energy-launches-in-california/",
  "content": "It was just several days ago that I wrote an article about [Tesla launching]( a huge EV charging hub that runs on solar power. Today I found another one. Though, it actually launched a little before the Tesla one. It’s a new hub with 18 fast chargers for fleet vehicles. The [press release]( from Terawatt Infrastructure says the source of electricity is renewables. “Solar canopies and 100% renewable energy powering every session.”\n\nThe location is Rialto, California, about 56 miles east of Los Angeles. The new fleet charging hub provides:\n\n* 24/7 security with 360-degree cameras and gated access to protect vehicles, cargo, and drivers.\n\nFor people who might think this new site is just a one-off, Terawatt opened a similarly sized hub [in April]( “The private site, shared among multiple fleets, will house a total of 20 pull-through and bobtail DC fast charging stalls and boast a capacity of 7MW — enabling charging for up to 125 trucks per day.”\n\nBut let’s get back to the [Rialto hub]( “The Rialto site brings Terawatt’s vision of a connected, electrified network to life. It provides fast, reliable, and high-speed pull-through charging along an electric lane that runs from the Ports of Long Beach and Los Angeles through Vernon and Commerce, culminating in Rialto. Our network enables companies to reduce emissions and run a variety of routes across a number of vehicle classes with the confidence of a dependable charging solution. EV fleets can now travel further, more cleanly, without slowing down their operations,” said Neha Palmer, CEO and co-founder of Terawatt.\n\nSolar power canopies generate electricity and don’t require vast amounts of land. They also provide shade and protection from precipitation.\n\nThere has been much good news about new EV charger installations lately, despite the loss of the federal EV incentives and a Trump administration that is anti-EV.\n\nUsing fully electric medium- and-heavy-duty freight trucks reduces harmful air pollution because they don’t burn diesel fuel or gasoline. There are some environmental benefits as well.\n\n* In the five-county region of Southern California, **119,200 workers** are employed in the EV industry, which is 43.4 percent of all statewide jobs (275,600) in the EV industry.\n\n* In California, the EV industry pays an average annual wage of $91,300, well above the average annual wage across all industries of $68,500.\n\n*Sign up for [CleanTechnica's Weekly Substack for Zach and Scott's in-depth analyses and high level summaries]( sign up for [our daily newsletter]( and [follow us on Google News](\n\n*Have a tip for CleanTechnica? Want to advertise? Want to suggest a guest for our CleanTech Talk podcast? [Contact us here](\n\n*Sign up for our daily newsletter for [15 new cleantech stories a day]( Or sign up for [our weekly one on top stories of the week]( if daily is too frequent.*\n\n### Share this story!\n\n* [Click to email a link to a friend (Opens in new window) Email](mailto:?subject=%5BShared%20Post%5D%20Another%20EV%20Charging%20Hub%20Running%20On%20Renewable%20Energy%20Launches%20In%20California&body=https%3A%2F%2Fcleantechnica.com%2F2025%2F11%2F30%2Fanother-ev-charging-hub-running-on-renewable-energy-launches-in-california%2F&share=email&nb=1)\n\nHello, I have been writing online for some time, and enjoy the outdoors. If you like, you can follow me on BlueSky.",
  "weight": "0.7",
  "pickup_count": 2
}