{
  "keywords": "bitcoin",
  "title": "Where will leading cryptocurrency Bitcoin be in 5 years? - USA Today",
  "url": "https://www.usatoday.com/story/money/2025/11/30/where-will-cryptocurrency-bitcoin-be-in-5-years/87537679007/",
  "content": "[Texas A&M falls out of top 5 in college football poll as Ohio State remains No. 1](/story/sports/ncaaf/2025/11/30/college-rankings-football-top-25-coaches-poll-week-14/87531678007/)\n\n[Get shopping texts 🛍️](/story/shopping/sign-up-for-usa-today-shopping-text-alerts/84130910007/) [All things auto 🚙](/cars) [Moving? Start here 🚚](/story/money/business/2025/10/22/best-moving-companies-in-state-2026/86555420007/) [💸 to your 📩](\n\n# Where will leading cryptocurrency Bitcoin be in 5 years?\n\n## Bitcoin's price has shot up more than five-fold since late 2020.\n\nBitcoin has been taking a breather for the past several weeks, but don't let that take attention away from its long-term performance. In the past five years, the leading cryptocurrency has soared 409% (as of Nov. 26).\n\nInvestors might be inclined to take a chance on Bitcoin on the recent dip. But where will this digital asset be in 2030?\n\nBitcoin has had a monster rise over the past decade. However, investors shouldn't extrapolate those gains going forward. The reasonable outlook is to expect lower returns, since the asset is maturing.\n\nThat being said, it wouldn't be surprising to see Bitcoin's price triple by the end of 2030. To do this, it would need togenerate a robust[compound annual rate of return]( of 25%. This would surely outperform the stock market by a wide margin.\n\nBitcoin's best trait is that it has a hard supply cap of 21 million units. This scarcity makes it a compelling asset to own, particularly as fiat currencies, such as the U.S. dollar, constantly lose[purchasing power]( over time.\n\nThe current regulatory backdrop works to Bitcoin's benefit as well, making it easier for companies to build related products and services and for investors to access the crypto.\n\nBitcoin currently trades at around $88,000. In five years, it's not out of reach for it to trade around the $270,000 mark, if the bull run continues. As always, keep your risk tolerance in mind.\n\n*[Neil Patel]( has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin. The Motley Fool has a [disclosure policy](\n\n*The Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY.*",
  "weight": "0.4",
  "pickup_count": 3
}